{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "The Linux Cast",
  "language": "en",
  "home_page_url": "https://thelinuxcast.org/",
  "feed_url": "https://thelinuxcast.org/feed/feed.json",
  "description": "Daily Linux Content on YouTube and Odysee",
  "author": {
    "name": "Matt",
    "url": "https://thelinuxcast.org/"
  },
  "items": [{
      "id": "https://thelinuxcast.org/posts/Early%20thoughts%20on%20Nano/",
      "url": "https://thelinuxcast.org/posts/Early%20thoughts%20on%20Nano/",
      "title": "Early Thoughts on Nano",
      "content_html": "<p><strong>Editor's Note: This was written just a week into me using Nano. Therefore I was still getting my sealegs.</strong></p>\n<p>I am writing this in nano. I challenged myself earlier this\nweek (as of writing this) to use Nano for a whole month, and I've stuck with it for almost a week.</p>\n<p>Almost.</p>\n<p>I'm not quitting, but I've come so close so many times.\nActually, I come close every single time I open the damn\neditor. Yes, it's that bad.</p>\n<p>No, I guess it's not that bad, but it's that bad for someone\nwho has been using Vim for years. Which is me.</p>\n<p>Most of my thoughts on Nano I'm going to save for the video I\nmake about it at the end of the month, no sense in having a ton\nof spoilers. But I do want to talk about one thing. The biggest\nfeature I miss on Nano.</p>\n<p>Visual Mode.</p>\n<p>I would have told you, as a Vim user, that visual mode is the\nthe least used mode for me. I would have been wrong. Okay, so\nmaybe Inert Mode is still the winner, but still, I apparently\nuse Visual Mode a lot more than I thought because I can't tell\nyou how many times a day I press V or Ctrl+V to do something\nand find that IT'S NOT EFFIN THERE IN NANO! (and yes, I know holding shift will get you there, but you're not helping).</p>\n<p>For F##$'s Sake.</p>\n<p>It drives me bonkers.</p>\n<p>Yes there have been the habit-caused mistypes hjkl and :wq, and\nno, those haven't stopped in a week, but the Visual Mode thing\nis by far the most frustrating because Visual Mode is so damn\nuseful and that it's not there, just makes Nano seem...bad.</p>\n<p>If someone were to ask me what my thoughts on Nano are right\nnow, I'd say I hate it. I hate it. It's not useful, the default\nkeybindings are bad, and the flow of the thing is just all wrong.</p>\n<p>I hope that I can get some positivity for Nano before I get to\nthe end of the month, but I doubt it.</p>\n<p>I miss Vim.</p>\n<p>Matt</p>\n",
      "date_published": "2023-06-02T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/5%20Things%20That%20Redcore%20Could%20Do%20Better/",
      "url": "https://thelinuxcast.org/posts/5%20Things%20That%20Redcore%20Could%20Do%20Better/",
      "title": "Wrapping Up Redcore - Things That Could Be Better",
      "content_html": "<p>This blog post was supposed to be done last week, but alas it got away from me. I still wanted to cover this topic, though, so I might as well go ahead and do it. I know it has been a while since I lost the challenge, but this is the last bit I needed to do before I can put it in the dustbin of history, as they say. So I want to talk about 5 things that I feel Redcore could do better. In the exclusive <a href=\"https://patreon.com/thelinuxcast\">patron only podcast</a> I posted a couple weeks ago, I talked about the things I really liked about Redcore. So, I figure in the blog post I'll focus on a few things that need to improve.</p>\n<h1>BTRFS Support</h1>\n<p>I'll be frank, this would have been a huge help for me, and if I'd had it, I probably wouldn't have lost the challenge. I know setting up btrfs on Gentoo can be a pain in the arse, but I really think an option for it inside the Redcore installer would be amazing. I know Calamares (which Redcore uses) has an option for file system selection, so it'd just be the back end that would need to be done. The main dev, who I've talked to several times, has told me that btrfs is coming, so that's going to be awesome. Just the option to do btrfs snapshots, will make the entire Gentoo thing less stressful.</p>\n<h1>Other DE/WM Options</h1>\n<p>This is the hardest for a small dev team to do, simply because it takes time to manage. But a couple other options other than Plasma would be awesome. And again, this is coming. There's a Qtile version that will be a part of the next release. Personally, I'd love an XFCE version, but I'm asking too much. With a DE and a WM, it will be much better than it is now.</p>\n<h1>Make It Easier to Get to Rolling</h1>\n<p>On their website, they claim that Redcore is build on Gentoo Testing, and it is, but there's an asterisk there that's not apparent. Redcore maintains their own repositories that are delayed away from the main Gentoo testing repos and they have another (I think it's called <em>next</em>) that is closer to testing than the main one is. You can use Sisyphus to switch, but it's not as easy as you might like it to be, especially if you don't use the GUI (which I didn't even know existed until I wanted to change repos). A simple command of some sort to switch would make it so much easier. A script or something. I also think they could be more umfront on their website about how the repos are actually set up. Saying it's based on Gentoo Testing is a little disingenuous, at least in my opinion.</p>\n<h1>Sisyphus is a Stoopid Name</h1>\n<p>Redcore has it's own package manager. It's name is Sisyphus. I have never once typed it out without mistyping it. I don't really know what else I need to say. The package manager name is dumb and hard to type. I'm sorry, but it is. It shouldn't be a Sisyphean Task just to spell the damn package manager. You see what I did there? lolz.</p>\n<h1>More Gentoo Tools Please</h1>\n<p>I'm aware now, more than ever, that I didn't use Redcore like I think the devs want you to use it. You're supposed to rely on Sisyphus more than I did, you're supposed to stick with Plasma, and you're supposed to use the GUI tools that they provide. I didn't do that. I used emerge and I used a window manager, and I used the terminal to do all my management of Redcore.</p>\n<p>One of the stated goals of Redcore is to allow people to get used to using Gentoo without all the hassle of installing it. I think they could do a better job of this, by making it more like Gentoo and less like its own separate thing. One of the ways they could do this would simply be to include more Gentoo terminal tools out of the box. Things like eix and equery so that it's easy to find packages and overlays. That'd be awesome.</p>\n<h1>Conclusions</h1>\n<p>I love Redcore. Honestly, I may give it a try again one day. I'm not a Gentoo guy, as I've now conclusively proven, but the distro itself was really good for the three months that I used it. And I think it says a lot about how true that is that I was only able to come up with the things above that they should improve (2 of which are already on the list of things to do). So good job Redcore. I will keep an eye on you. #Creepy</p>\n<p>I hope everyone has a great week. If you're reading this on the\nwebsite, you can get all of my blog posts two week's early by\nsupporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2023-05-22T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/hoarder/",
      "url": "https://thelinuxcast.org/posts/hoarder/",
      "title": "I Have a Hoarding Problem",
      "content_html": "<p>I have a problem.</p>\n<p>I don't think it's actually a problem, but it feels like it's a problem.</p>\n<p>I hoard tabs.</p>\n<p>Now I don't think there's anyone who watches my content that is all that surprised that I like tabs in every application, nor that I tend to use them an awful lot. I have always been very upfront about my love and devotion to all things tabulated. Okay, Matt, a little creepy there, but it's true. I ❤️ tabs and I miss them when I don't have them.</p>\n<p>But I do have a bit, a smidge, a little, hoarding problem. I may have taken it to far. I have over 100 open tabs in Firefox right now. A vast, vast, majority of them have been open for <em>months</em>. Some of them are for video ideas that I'm pretty sure I'll never get to</p>\n<p>But I might. So I keep the tab.</p>\n<p>Now, I am a smart guy. I have a degree just to prove it. So I know, I know, that there are better ways to save content for later so I can find it easy and use it. Things like Pocket exist. Hell, I could just create a bookmarks folder. Bookmarks have been around for 30 years or more (on the internet, I mean). I could put them in a plain text file and organize them within my video's directory. I could put them in a notes app like Google keep.</p>\n<p>You get the idea. There are a ton of ways I could go about saving content that doesn't see me keeping that content in a Firefox tab for months or (and I do have at least one) years.</p>\n<p>But the system works for me, and takes zero effort. I'm all about zero effort, as many as you guys know. When I find something I want to save, I just send it to the appropriate tab group in Firefox and there it lives until I need it. I do close tabs when I'm really done with them, so it's not as if I truly have a sickness where I can't stand to part with a tab. But, I do keep a lot of them around when  a lot of them could be closed. I mean, come on, I have been planning a TaskWarrior video for two years. I don't think it's going to happen at this point, I can probably shut the tab with that documentation down. But the monster in my brain says that I still want to do that video, even though I haven't yet gotten around to it, so the tab stays.</p>\n<p>I know that I am not the only one who hoards tabs. There are many people who are worse than I am. At least all of mine are organized into groups. Some folks just have them all open without grouping them and that would make me grind my teeth. Also, if groups didn't exist, I think I'd probably not have so many open tabs. In fact, I know I wouldn't, since before I discovered Simple Tab Groups in Firefox, I was quite proud of myself for only ever having a few tabs open.</p>\n<p>A ton of open tabs seems to be the equivalent of storing every file you download and save on your desktop. You know those people, we've all seen the pictures.</p>\n<p><a href=\"https://thelinuxcast.org/img/manuicons.jpg\"><img src=\"https://thelinuxcast.org/img/manyicons.jpg\" alt=\"Icons\" /></a></p>\n<p>While I do organize my tabs, it still feels a bit like that messy desktop. It's not the way it's supposed to be done, nor is it the best way to do it. It can be done, but there are better ways.</p>\n<p>So, will I change? Maybe. I've been thinking about how I can improve my system so that I don't have so many open tabs open. Maybe a rule that if I haven't used the tab in 2 months, I can shuttle that link into a file somewhere and close the tab. I have a feeling if I go that route that I'll never see those links again. The equivalent of shoving those things in a closet somewhere, never to be heard from again. I have my worries that if I'm not at least reminded of those ideas that I currently have in tabs once in a while, I'll never remember that I had those ideas.</p>\n<p>It's an odd situation to be in. It's not as if my hoarding is hurting anyone. I have plenty of resources, and most of the tabs aren't loaded by Firefox, so they aren't in memory anyway. So maybe I just stick with what feels natural to me right now. I guess we'll see.</p>\n<p>Do you hoard tabs? Let me know in the comments below.</p>\n<p>Hope everyone has a great week. If you're reading this on the website, you can get all of these posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2023-05-10T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/An%20Obsession%20With%20Gruvbox/",
      "url": "https://thelinuxcast.org/posts/An%20Obsession%20With%20Gruvbox/",
      "title": "An Obsession With Gruvbox",
      "content_html": "<p>How many people do you think could write a blog post about their obsession with a color scheme? Well, you know at least one, because that is what I'm about to do. Now, I have in fact made a <a href=\"https://www.youtube.com/watch?v=uWjNQbhGz4E\">video</a> about it already. I have considered making another video about it.</p>\n<p>I love Gruvbox that much.</p>\n<p><a href=\"https://thelinuxcast.org/img/gruvbox.png\"><img src=\"https://thelinuxcast.org/img/gruvbox.png\" alt=\"Gruvbox\" /></a></p>\n<p>The funniest thing is that I didn't used to like it at all. Brown isn't really my color, neither is orange for that matter, and when I saw it for the first time I was not impressed. I thought it quite ugly, to be honest. But then I decided to try it and since then it has become my all time favorite color scheme. It's not even really all that close. Sure, I use others (Everforest, catppuccin and moonfly to name a few), but Gruvbox is the one that I keep coming back to and the one I usually end up sticking on the longest without switching.</p>\n<p>I can't sit here and name technical reasons why Gruvbox is better. I have friends in the Linux community that hate it, I have friends that love it just as much as I do. But there is something about these colors that just go together so well. The contrast is wonderful, making it supremely readable, and it's just colorful enough that it isn't boring.</p>\n<p>So many themes these days are based on Nord and OneDark. Both are so boring and samey. How many bloody shades of blue can you get? Boring, I tell you. And the oddest thing about those two themes is that there are so many forks of them. Like making one little change to adjust the hue of one of the shades of blue is going to make a ton of difference. Don't get me wrong, people like what they like and that's the way it should be, but I cry a little inside when I see so many people using the same four shades of OneDark. It's sad and depressing. Gruvbox is so much better.</p>\n<p>Granted, I know it's not for everyone, but it is really just so good. I think if more people gave it a good try, they'd find that it was better than they thought. I'm not so sure that this applies to the light theme, but I don't like light themes in general, so nothing is going to change my mind there.</p>\n<p>A pointless blog post? Yes. But, Gruvbox is awesome, and I'll fight anyone who says otherwise. Not really, but the idea was good. Anyways, time to take my tired ass to bed, obviously sleep deprivation is not good for solid blog post ideas, who knew?</p>\n<p>If you're reading this on the website, you can get all of my blog posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>. Hope everyone has a great week,</p>\n<p>Matt</p>\n",
      "date_published": "2023-04-25T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/tiredofredcore/",
      "url": "https://thelinuxcast.org/posts/tiredofredcore/",
      "title": "Redcore is a Bit Boring",
      "content_html": "<p>I'm almost, almost, 2 months into the #6MonthLinuxChallenge. Almost.</p>\n<p>I'm sick of Redcore. It's not as if there is anything wrong with it, though I'm having an issue keeping my clock appropriately set. Redcore has been fine, as I said in my video a few days ago. It's stable enough, I have access to most of the software that I want, and it just works.</p>\n<p>But I'm astonishingly bored with it, to tell you the truth. Maybe my expectation of using a &quot;Gentoo Based distro&quot; is that more things would go wrong? Maybe I'm looking for that one thing that I need to fix. I'm bitching and moaning about my distro being too stable. It's an odd place for my mind to be in. I think mostly the reason why I'm feeling this way is simply because I want to Distrohop. It's been ages since I've installed a distro on my main computer and I want to go do that.</p>\n<p>I think part of it is due to my recent bout with COVID. I'm very interested in a fresh start right now, and that means revamping my computer. Being in the same place for so long (and knowing that I still have 4 months to go) just makes me feel antsy.</p>\n<p>It's also the reason why I've been messing around with other window managers almost every single day. Even though I keep coming back to Qtile, I still long for something fresh. A challenge of some kind.</p>\n<p>I didn't know when I started the 6 Month Challenge that the challenge wouldn't be using the distro and suffering through the hardships of using an obscure distro, but instead suffering through the boredom of using the same distro for so long. That's an odd challenge.</p>\n<p>And really, it makes no sense, since I stuck with Fedora for 8 months and was perfectly happy to do so. I don't know what's changed other than I feel like Redcore is so meh for me right now.</p>\n<p>Honestly, I'm babbling right now. In a blog post. Who even does that?</p>\n<p>A blog post as a stream of consciousness. Maybe there's a startup idea there. lol.</p>\n<p>Anywhoo, what am I going to do? Well, the obvious answer would be to fail at the challenge, which I'm not going to do. Nay. I refuse to lose. Josh failed, but I will not. No, instead I think I'm going to delve down into the root cause of my boredom: needing something new. I'm going to go ahead and start that Xmonad challenge tomorrow like I've been planning for ages. Maybe getting into something like that, which will be a challenge, will make me happy. I've been too comfy in Qtile. If there is something sure to scratch my itch for a challenge it will be Xmonad and Haskell. Then again, maybe it will drive me away from Linux altogether. JK.</p>\n<p>I'm also going to do some distro testing on my laptop. That will be a bit of fun and will allow me to use some other distros without hopping on my main computer. Maybe make some videos on some immutable distros. I'm getting more interested in Silverblue the more I read about it, and I want to try to create my own image. That could be really fun.</p>\n<p>So, that's it for me this week. Having an identity crisis and wavering on my interest in Redcore. Thanks, everyone for sticking with me through my COVID weeks, I'm seemingly back to normal except for some cold-like symptoms, so I should be back to posting regularly.</p>\n<p>Hope everyone has a great week. If you're reading this on the website, you can get all of my blog posts by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2023-04-12T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/pythongoals/",
      "url": "https://thelinuxcast.org/posts/pythongoals/",
      "title": "I&#39;m Going to Learn Python",
      "content_html": "<p><em>Note: This was written ages ago, so any time references will be way off.</em></p>\n<p>So, as I talked about in my goals post way back in January, I have decided to finally buckle down and learn how to code and I've chosen Python as my first language.</p>\n<p>Now, it is March, and I am finally getting started on that goal. Part of the reason it has taken so long is RL has just been kicking my ass since November with family health problems and other things going on. So I'm just now getting to the point where I can spend some free time actually learning how to do something new.</p>\n<p>The other reason, of course, is pure laziness. I always push off things I'm unsure of, and to be honest, I'm not sure if I'll be any good at this.</p>\n<p>I've already failed once.</p>\n<p>Back in 2004, when I was selecting a major at Michigan State University (Go Green!), I decided that because I liked computers so much, I should choose computer science as my major. I lasted a full year and damn near flunked out. It took me a change of majors (History) and two semesters to get myself off of Academic Probation.</p>\n<p>So, I have some anxiety when it comes to if I'm even going to be able to learn how to code. There's a bit of a mental block there, so that is going to be something that I will have to get through in order to do this.</p>\n<p>The question you might be asking is, why do it if you've had so many problems. The answer is that there are things that I want to do. Scripts that I want to write. Programs that I want to create. I have a few ideas for big projects, and I can't do them right now with my very limited amount of experience with C (the only language I have some knowledge in).</p>\n<p>So, I'm buckling down and I plan on doing this. I've had some struggles so far. The first one is that it is really hard to know what a good tutorial is without actually sitting through it. I think Mosh is going to be the first one I go through. He seems to really focus on doing this from a noob standpoint. Others seem to assume that I have some knowledge of coding, and those won't do me much good because I need to learn the jargon from the ground up.</p>\n<p>You know, things like, what a string is, what an array is, and so on. I have some idea what those things are, but you can't do things when you only have some idea. You have to <em>know</em>.</p>\n<p>That's the first hurdle I faced, finding a good tutorial. I've also had to deal with naysayers who I've talked about this with. People who are so set against Python that they'll get nasty about it. As much as the whole Arch and Gentoo fanboy community entertains me, the fanboys of certain coding languages actually scare me. These guys are very passionate about the languages that they love and just as passionate about the languages that they hate. It was so bad I decided to just nope out of the developer's discord I joined and go solo.</p>\n<p>So, I have started. Tonight. I'm about 5 minutes into Mosh's 6 Hour tutorial. I plan on doing 10 minutes a day or so. Not much, and maybe as I get more comfortable I will up that to a half hour, but for now, I'm dipping my toes into it. Easing myself in, if you will.</p>\n<p>We'll have to see how it goes. I doubt this will be my last blog post on this topic, so be prepared for that. I don't know if I'll do any videos on this. To be honest, I don't know how they'll do as it doesn't seem like the type of content my audience would like. But maybe I'm wrong.</p>\n<p>Anywhoo, I hope everyone has a great week. If you're reading this on the website, you can get my blog posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>. Also make sure you follow me over on <a href=\"https://fosstodon.org/@thelinuxcast\">Mastodon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2023-04-04T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/qtile/",
      "url": "https://thelinuxcast.org/posts/qtile/",
      "title": "Qtile Is Effin&#39; Awesome",
      "content_html": "<p>So, last week <a href=\"https://thelinuxcast.org/posts/xmonad/\">I wrote</a> about how I was commissioned to try xmonad for some time. I think, probably, y'all found that I was not so...shall we say, looking forward to it. Xmonad isn't my favorite, and as I said in that blog post, me and that Window Manager have a history. So, is it at all surprising that I got sidetracked on the way to Xmonad?</p>\n<p>No. Not it is not. LMAO.</p>\n<p>When I couldn't immediately get Xmonad to install on Redcore, I gave up and decided that I was going to give qtile a try. This after talking to one of my fellow Linux YouTube Creators who has recently switched to Qtile using my config. I decided that it has been a fair bit since I used Qtile and that it was high time that I give it another go. It had nothing to do with procrastinating my eventual successful installation of Xmonad. Nay. Nothing at all.</p>\n<p><a href=\"https://thelinuxcast.org/img/qtile.png\"><img src=\"https://thelinuxcast.org/img/qtile.png\" alt=\"qtile\" /></a></p>\n<p>So, I've spent the last week using Qtile. It's wonderful, it really is. I always kind of forget how good it is because of my continued and eternal love for i3 Window Manager. While I'm not as knowledgeable about Python as I am about the non-language that i3 is configured in, I know my way around Qtile a bit, and it has been a blast getting my config all spruced up after a few months of neglect.</p>\n<p>I think maybe, some of my happiness over doing this is because I need to feel something new, what with my habitation of Redcore for the next 5 months or so (it's counting down!). I'll have another blog post about Redcore next week, but needless to say, while I don't hate it, I miss Fedora. So, hopping from one Window Manager to another has been my fix for all that.</p>\n<p>Qtile is extensible enough that it has kept me busy in the off times. I've added some widgets to my bar, created a few new things, and have started to work on a script so I can change between themes easily with rofi (similar to how I did with i3). It's been, as I said, a blast.</p>\n<p>One thing I noticed, is that Qtile does scratchpads way better than i3. I don't think the last time I used Qtile, I really thought that was the case. It's not as if i3 has bad scratchpads, but I've always thought they were good enough with some flaws. No other WM has ever matched up to DWM's scratchpads, so thinking about comparing i3 and Qtile's scratchpads never really occurred to me.</p>\n<p>But, Qtile's are better. For one, it's slightly easier to dictate the size for scratchpads inside the config. i3 can do it fine, but it's just a little easier in Qtile (it can be done when you configure the scratchpad, not in a separate rule). Second, and this is the big one when you kill a scratchpad in i3, it goes away. In Qtile, it relaunches. In i3, you'd have to restart i3 to get the scratchpad to relaunch. Joris even made his so that they could not be killed (or at least he tried, can't remember if he was successful or not). With Qtile, none of that matters, since they just pop back up if you kill them off.</p>\n<p>i3 does win in one place, when it comes to scratchpads, though. When you pop a scratchpad out of the scratchpad space on i3, it's simple to pop it back in, in its current use state. In Qtile, that seems to be impossible. Once a scratchpad is no longer a scratchpad, it can't be made one again. That's not a huge deal, but it is a bummer given how good the system is otherwise.</p>\n<p>Now to go back and count how many times I used the word scratchpad in the previous paragraphs. LOL.</p>\n<p>Outside of the scratchpad thing, I love qtile's bar. While I wish that it was easier to put in my own scripts (that is apparently going to get easier in the next version), the built-in widgets that Qtile offers, are amazing. I love Polybar, and it remains my favorite bar just because I'm most familiar with it, but Qtile's bar has taken the #2 spot. I don't care as much for the configuration of it, especially when dealing with multiple monitors, so it probably won't ever be my favorite, but it is still really, really good.</p>\n<p>Finally, I like the way it does workspaces. You can move workspaces between monitors easily on i3, for sure, but the default way Qtile handles workspaces is wonderful. Once you get used to the idea of the workspace being fluid and moving between monitors, you really learn to love that workflow. It always takes some getting used to, but I think I always miss it for a bit when I go back to a Window Manager that has its workspaces or tags hard-wired onto a monitor.</p>\n<p>So, yeah, Qtile. Not Xmonad. I did get Xmonad installed, finally, thanks to the Redcore developer who took care of some issues with one of Haskell's dependencies. But I have not booted into it yet. First, I'm dreading it, but I'm also just loving Qtile too much right now. So it will wait a few days or weeks until I feel the need to hop again.</p>\n<p>If you're reading this on the website, you can get all of my blog posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>. Hope everyone has a wonderful week,</p>\n<p>Matt</p>\n",
      "date_published": "2023-03-06T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/xmonad/",
      "url": "https://thelinuxcast.org/posts/xmonad/",
      "title": "Xmonad is Coming",
      "content_html": "<p>I have a long and bloody history when it comes to the Xmonad window manager. I hate Haskell with a passion. Mostly, it's a me problem. There is nothing inherently wrong with Haskell or Xmonad, I just don't feel smart enough to actually use them. Every time I try, I get frustrated by them.</p>\n<p>But, it's time to try them again. One of my upper-tier patrons has asked, and I have agreed to do so. I don't know yet how I'm going to do it. I think it will start off as a side project on my laptop before it moves to my main machine, but I may change my mind.</p>\n<p>So, I'm trying Xmonad again. It's going to be something I try to do long term. I'm not going to be giving it my full attention while the #6MonthLinuxChallenge is going on, so I don't expect to make many videos about it until this challenge is over, but if I'm going to give it a real shot, might as well start soon.</p>\n<p>We'll see how it goes. I've tried it three times before to varying success. Usually, I have failed because of something that I just couldn't figure out. Usually, it's scratchpads. I did get it figured out once, but the Xmonad implementation is not great. Granted that wasn't a long exposure time to that feature and it's been at least a year since then, so maybe I'll do better this time.</p>\n<p>And that's kind of the hope. That now that I'm a little more comfortable with programming languages (C and Python), I may be able to finally get my head around Haskell enough at least to use Xmonad for a while.</p>\n<p>I guess we'll see. This is a very short blog post this week. RL is kicking my ass, so this was a bit of a rush job. Hope everyone has a good week. If you're reading this on the website, you can get all of my blog posts along with an exclusive weekly podcast by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2023-02-28T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/gentoisscary/",
      "url": "https://thelinuxcast.org/posts/gentoisscary/",
      "title": "Redcore (And Gentoo) Scare Me",
      "content_html": "<p>So, if you haven't been paying attention to the channel, you'll have missed that I started a challenge that has grown quite popular. I called it, creatively, The 6 Month Linux Challenge. The goal is to use a new distro for 6 months without hopping a single time on your main computer.</p>\n<p>Being the idiot that I am, I let others choose for me. I ended up on Redcore Linux. For those not in the know, it is based on Gentoo of all things.</p>\n<p>I've talked about my first day already in a <a href=\"https://www.youtube.com/watch?v=K12IijGXALc\">video</a>, so I won't go into all of the details, but I wanted to talk a little more about it as I'm now (as of writing this) three days in.</p>\n<p>The one, over-arching thought I have, is that Gentoo is anxiety-inducing. Kind of like Arch was when I first got into Arch. There are so many stories of Arch being unstable and horrible when it comes to stability, and OH MY GOD! You're going to lose all of your data, and holy hell I need to run back to Ubuntu! Take a breath. Arch has a reputation for being like that, but as most who have used it have found out, it's not so bad once you learn what you're doing.</p>\n<p>Gentoo has the same feeling, only it's way worse. I feel like I'm constantly on the edge of breaking something. Most of that, probably, is me not knowing what the hell I'm doing half the time. Did I say half? More like 90%. It isn't as if I'm not learning my way, but it feels like there is so much on Gentoo that is just done differently that I feel like I'll never quite be comfortable with it all.</p>\n<p>There are two things I've taken away from all of this. First, despite the discomfort of feeling insecure in my knowledge of Gentoo, I am having loads of fun. I've been looking forward to getting to my computer every day to see what I can learn. It has been a blast. The other thing is that Gentoo is really not meant for noobs. I know it seems to go without saying, but Redcore seems to be a distro that is trying to make Gentoo easier, and I don't think it does its users any favors. You have to know a lot about Gentoo and about Linux in general to make this work (and work well), and that's not really the type of audience that might look at distros like Redcore.</p>\n<p>I wouldn't recommend Redcore to anyone who isn't also really interested in using Gentoo. In fact, I don't think I'd recommend it to someone who has never <em>installed</em> Gentoo. You really need to have some experience going in.</p>\n<p>Maybe Sabayon and Calculate Linux are different, I don't know. I kind of look forward to finding out if those have a more &quot;noob-friendly&quot; feel. I doubt it. It's Gentoo, no matter how you paint it, and that requires some know-how.</p>\n<p>Which is where I find myself in a hole. I know just enough about Gentoo to be dangerous, and that's what makes this both fun and horrifying. Every time I update or emerge a new package, I feel like I'm going to ruin everything. I've started taking daily backups of my computer to ensure I don't lose anything I would be sad to lose.</p>\n<p>I'm at day 4 now as I write this. Still basically the entire 6 months to go. I doubt this will be the last blog post I write about my Redcore/Gentoo adventures, so hold onto your butts, it's gonna be a ride.</p>\n<p>Hope everyone has a great week. If you're reading this on the website, you can get all my blog posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2023-02-24T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/browser%20anxiety/",
      "url": "https://thelinuxcast.org/posts/browser%20anxiety/",
      "title": "I Hate Web Browsers. There Are No Good Ones.",
      "content_html": "<p>I talked about this a bit in a recent video, but I've been thinking about my browser situation. A lot of the stuff Mozilla does pisses me off, and the new extension menu thing is one of them.</p>\n<p>I know it's dumb to complain about, and I know with some work it can be disabled, but I hate it with a passion. Not only did it break userChrome (at least mine), but it just adds several extra clicks if you want to get to an extension that you didn't have pinned before or it seems to.</p>\n<p>It's dumb and I continue to complain about it.</p>\n<p>So I've been thinking about switching browsers. I made a video not too long ago where I thought about running a dual browser setup, but when several people mentioned Firefox containers, I got hooked on those and abandoned the idea of two browsers.</p>\n<p>Now I think I may want to leave behind Firefox, but it's really effin' hard. Two things hold me back: Simple Tab Groups and Firefox Containers.</p>\n<p>STG is one of those plugins that I just can't live without. Every browser has tab groups of some kind, but most of them shove the groups up into the tab bar and keep them there, even if they are compressed in some fashion. STG puts the groups in a dropdown menu, and that's awesome. Add onto that, you get customizable keybindings for rotating between groups, and it's just awesome.</p>\n<p>With Firefox containers, as I explained, it keeps all my stuff separated and makes it so Google et al only tracks me when I want them to. It has done wonders for my privacy, or at least my sense of privacy.</p>\n<p>The issue is, no browser does Tab Groups as well as STG, and the alternative to containers on other browsers seem to be profiles, which are either tied to an account or not easy to switch between or both. None work as well as Firefox Containers.</p>\n<p>Those two features have become essential to my workflow, and it is hard if not impossible to leave them behind.</p>\n<p>So my browser angst continues. I'm going to disable the extension menu and see how long that lasts. The good news is that Mozilla doesn't always nerf their about:config options quickly, so a workaround to get rid of the menu may last years. Then I can bring back my userChrome and I can be happy again for a while.</p>\n<p>But I'm going to keep trying other browsers. I tried Vivaldi, and despite what their fans say, it's garbage. Sure, it has loads of customizability, but I found it slow and the &quot;groups&quot; functionality (they call them stacks), is not good at all. I didn't stick around long enough to try the profiles option, but I doubt it is as good as containers.</p>\n<p>This is the problem with the browser market all being based on Chromium. All the browsers are exactly the same. There are no options if you want something different. I have considered Edge. I know, it's from Microsoft and they're the devil, but I know that Edge does do groups fairly well and maybe their containers alternative is good, I'd have to see. But it is from the Red Devil, so it gives me pause. Besides, I know they've added a ton of bloat to that browser which makes it even less appealing.</p>\n<p>Then there are the other half dozen Chromium-based browsers. All are basically clones of each other, though there are some open-source options. Maybe I give UnGoogled Chromium another try. I know I don't care for Chome's groups, but maybe I can work around it. Brave is a no go, even with turning the Crypto stuff off, I don't care for that company.</p>\n<p>It's really hard. What I really want, what would really be awesome, is for Mozilla to stop pissing me off with dumb ass features. Why can't they just be good? Firefox is mostly exactly what I want with a browser, but Mozilla continues to do small things that just make me not want to use Firefox anymore.</p>\n<p>I guess I need to learn to code so I can build my own browser. LOL.</p>\n<p>Hope everyone has a great week. If you're reading this on the website, you can get this early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>, you can also get a weekly Patron exclusive podcast!</p>\n<p>Matt</p>\n",
      "date_published": "2023-02-14T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/I%20Miss%20Window%20Managers/",
      "url": "https://thelinuxcast.org/posts/I%20Miss%20Window%20Managers/",
      "title": "I&#39;m Missing My Window Managers",
      "content_html": "<p>So I've been using XFCE for two weeks now (when I wrote this post a week ago). Overall, it has been a <em>wonderful</em> experience. Very satisfying and very educational.</p>\n<p>But the workflow is entirely different than what I'm used to. Not different as in bad, but different as in, it's taken me a while to get used to.</p>\n<p>And I have gotten used to it. I've gotten used to knowing where my windows are in the pile of windows that I always have. I've gotten used to only using one workspace. I've gotten used to having windows in different places than what I'm used to because I'm always moving them around so I can see other windows.</p>\n<p>It's been fun if I'm being honest. It's so completely different than the workflow you experience when using a tiling window manager, that I've found myself entertained rather than annoyed.</p>\n<p>But now that I'm further along in this experiment, I've been missing my tiling window manager. I've been talking to some friends who use window managers, and my jealousy has been increasing over the last few days. Every time I see a cool i3 or DWM post on r/unixporn, I think about how wonderful it's going to be to use a window manager once again.</p>\n<p>And it's not even as if XFCE is bad or I'm hating it. As I said, I love XFCE and I've found myself having a lot of fun using it and even liking this workflow. I've been productive using it, so it's not as if I lost productivity when switching.</p>\n<p>But I miss tiling. A lot. And it's not just seeing others use it, I miss the customization and organization that you get with a window manager. As I said either in a patron-only pod or in a blog post, I have found myself relying on GUIs a lot more, and that makes me feel like I've lost my inner nerd. It's dumb, I know, but it's the way I feel. Granted, I am writing this in a terminal (vim ftw), but I find myself doing this less and less. Even with work, I find myself just working in Marktext.</p>\n<p>There's nothing wrong with using a GUI all the time, at least that's what I say on the channel, but I like using the terminal, and for whatever reason, using XFCE has had me use GUIs more.</p>\n<p>I've talked about all that before, but in relation to WMs, that's all a part of why I want to go back.</p>\n<p>So, what am I going to do? Well, I'm going to cheat. They say, &quot;if you ain't cheatin' you ain't tryin'&quot;. So, I'm going to look into making i3 or bswpm my window manager <em>inside</em> XFCE. Meld the two together and get the best of both worlds.</p>\n<p>If this works out, this could be a long-term solution, because there are things that work better in a Desktop Environment (polkit just to name one). If I can get a tiling experience inside of XFCE (I'm told that it is pretty easy) then I should find myself very happy.</p>\n<p>I guess we'll see. That will be my task for the next couple of days. I know I wanted to use pure XFCE for 2 months, but I think I'll be more likely to finish this experiment if I go this route. As I said, I guess we'll see.</p>\n<p>Hope everyone has a great week! If you're reading this on the blog, you can get this content along with a brand new weekly Patron exclusive podcast by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2023-02-07T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/NoScratchpads/",
      "url": "https://thelinuxcast.org/posts/NoScratchpads/",
      "title": "Missing Scratchpads",
      "content_html": "<p>So as I've been talking about both in the Patron Exclusive Pod (available to all tiers) and on the channel, I've switched to XFCE. My plan is still to be on XFCE for 2 months (As I write this, I'm only a week in).</p>\n<p>I do miss my window managers, that's for sure. I'm going to be itching to go back once this experiment is over, I have a feeling.</p>\n<p>But there is one thing that I miss more than any other and that is scratchpads. Now, I do have a dropdown terminal (I use Tilix, and that has a quake mode, which is pretty nice), but it's just not the same.</p>\n<p>When I'm on i3wm or whatever, I always have about six scratchpads that I open up many times a day. I have newsboat there, I have pulsemixer, I have ncmpcpp or whatever it's called, I have ranger, and couple extra empty terminals. All of them are available via a separate keybinding for ready and easy use. It's awesome.</p>\n<p>On XFCE, none of that is here. Not that's not possible, because I'm sure that with some effort I could replicate that functionality (in fact, I'm sure I could, and I may do), but it's just something that isn't default or something that I think most people would even consider unless they've used a window manager before.</p>\n<p>And that brings me to Workspaces. I mentioned this on my patron-only pod, but I don't use workspaces nearly as much on XFCE as I did when in a window manager. One of the reasons why is that windows pile up and don't tile by default. So I don't have to deal with smaller and smaller windows, and can just leave a whole pile of them on one workspace and alt-tab to the one I need. Another reason why is the absolutely crap way XFCE (and other DEs) handle workspaces with multiple monitors. They treat both monitors as a single workspace, so when you change workspaces, both monitors change. You can't get them to be independent. It just feels inefficient and against everything I know and love when it comes to workspaces.</p>\n<p>Honestly, the mess of it all is driving me batty. Right now as I look at it, I have seven windows on my second monitor, all piled on top of one another. I can only see the top two. It feels so...trashy. And completely inefficient. Obviously, this is not an XFCE problem, but it is a DE problem, and it's a big one. The workflow here is just anathema to the way I have worked for the majority of the last three years.</p>\n<p>So, those are the two big problems. Scratchpads are probably something I will solve on my own because I do miss them enough that spending the time to figure all that out makes sense. The workspace thing is something that will continue to just drive me nuts until I eventually say eff it and either install i3 and use it with XFCE or I abandon XFCE completely. Who knows which way that will go.</p>\n<p>I hope everyone has a nice week. If you're reading this on the website, you can get all of my blog posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Pareon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2023-02-01T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/Pixel7ProReview/",
      "url": "https://thelinuxcast.org/posts/Pixel7ProReview/",
      "title": "Google Pixel 7 Pro Review",
      "content_html": "<p>I have been on a bit of an adventure when it comes to my mobile phone. For the last year, I've been on the Galaxy S22+, which I purchased used off of Amazon (or refurbished). It served me well, but as the year went on, the battery life got progressively worse. So bad, in fact, that it would only last about 2 hours on a charge.</p>\n<p>So, I decided that I need to upgrade. Yes, I could have paid for a battery replacement, and I still might do so (I still have it), but I like new stuff, so I decided that I'd get a new phone. For the last few years, I have prided myself on always buying used or refurbished devices. It makes me feel a bit better about e-waste and such. This time, I splurged and decided to buy new.</p>\n<p>My first attempt at this was the OnePlus 10 Pro. That device ended up being so buggy that I had to send it back. I wanted to like it, but I couldn't deal with the bugs and the slow software updates to the US were a definite problem.</p>\n<p>So, I sent that back and pondered for a while. I thought about going back to the iPhone but I really have lost all taste for iOS, so that was a no-go. I then decided that I'd go with a Pixel after talking about it with friends on <a href=\"https://fosstodon.org/@thelinuxcast\">Mastodon</a>. I've never had a Pixel before, always being scared off by their constant hardware and software issues in past generations. But this generation seemed to be mostly free of that nonsense (This was before I found out that the camera lens was spontaneously exploding), so I decided to give it a go.</p>\n<p>I bought the Pixel 7 Pro because I love big-screen phones, and I've been using it for the last several weeks. Here is my brief review.</p>\n<h1>Hardware</h1>\n<p>The hardware on the Pixel is not for everyone, that's for sure. I hated it last year, which is why I didn't get it when I decided to go back to Android and chose the Galaxy S22+. I honestly wasn't sure that I'd like it any better this year, but I changed my mind. Most phones are getting taller and taller and staying the same width. I don't mind taller phones, but I also want something that feels wider in my hand. The Pixel 7 Pro does this, and I'm very happy about it. It feels like it fits my man hands, and it's the first Android phone that has ever done so.</p>\n<p>The cameras are awesome, but I'm not a pixel peeper, so I had no problems with the cameras on my phone four or five years ago. Are they better than that, yes. But I don't really notice all that much. I know the photography nerds out there are shouting at me, but I'm not one of you. I just don't have an interest in it, I'm afraid.</p>\n<p>The screen is big and bright and the refresh rate is nice (though I did end up turning it back down to 60hz, which I'll talk about later). It is slightly curved along the sides, which bugs the crap out of me. Not that it doesn't look great, but the accidental touches are something that phone manufacturers haven't ever really figured out. I still end up having it accidentally thinking I'm touching the screen when I'm just scrolling along. It's annoying but doesn't happen so often that it's unbearable.</p>\n<p>The under-screen fingerprint sensor is fast and mostly responsive, though it does have a problem with my right thumb despite me reteaching it several times (the S22+ had the same problem, so I think my thumb is the issue). The rest of my figures that I've trained work fine.</p>\n<p>One of the biggest issues I have with the hardware is that the volume and power buttons are really, really low on the side, and I always press the power button when I meant to go to the volume button. That's annoying and could have been solved if someone had actually tested the device beforehand. Why phone manufacturers have to have the volume buttons and the power button on the same side is beyond me. There's a whole other side there and it feels lonely. Do better Google.</p>\n<p>The last thing I should talk about is battery life. It's horrible. I mean like really bad. Not as bad as the Samsung I just left, but for a new device, it's really disappointing. I can get through 4PM on a single charge before I have to put it on the charger. That's not okay. I always have around six to ten more hours of my day before I can go to sleep, so a second charge is probably always going to be the case, but I'd expect a little more than what I've gotten so far.</p>\n<p>So I turned off the high refresh rate. I thought that would help, but it honestly made no difference so I turned it back on. I also tried to use the device at 1080p instead of 1440p, but that made everything so big on the screen that it was basically unusable. So, what I ended up doing was getting a case that has a MagSafe-like magnet on the back and a MagSafe charger. I now can charge the phone while I'm at my desk. Not what I want to do, but works okay.</p>\n<h1>Software</h1>\n<p>There is always a lot of talk about &quot;Stock Android&quot; and how close the Pixel is to that ideal. I've always wondered what the big deal was because honestly, I loved OneUI. The transparency and the great work Samsung has done in making it easy to use huge phones with one hand were really appreciated and made the S22+ a pleasure to use. I could have done without all the un-uninstallable bloatware, but whatever.</p>\n<p>The software on the Pixel 7 Pro is fine. It has some things I like, and some things I think are butt ugly. Let's start off with the things I like.</p>\n<h2>Material You</h2>\n<p>I like the adaptive color scheme. I know it's not a favorite of everyone, but having the colors change when I change the wallpaper, is nice. I wish it did a better job of actually choosing colors that are a part of the wallpaper, but for the most part, it's still pleasing. I also like that more and more apps are taking this on, so it feels more like the entire ecosystem is changing a bit whenever I change my wall.</p>\n<h2>Multitasking View</h2>\n<p>This is nice. Google has added several awesome features to the multitasking view that make it more useful. You can copy text right from that view, take a screenshot without going into an app, copy images, and so on. It's very nice.</p>\n<h2>Quick Settings Menu</h2>\n<p>It's not as good as Samsung's but it works fine and I like the design of it for the most part. I do think the buttons are too big here, they could have more settings on the first pull-down if the buttons weren't so big.</p>\n<p>Now let's talk about the rest and the things I don't like.</p>\n<h2>Lack of Transparency</h2>\n<p>I know this isn't a huge deal, but coming from the S22+, where transparency is all over the place, the lack of any transparency at all in the notification shade and elsewhere was really jarring. It makes it feel so outdated and kind of fugly, IMO. It just looks so much better on the S22+ that I almost sent the Pixel back. It just looks so bad.</p>\n<p>The big buttons are also very odd. As I mentioned before, it'd help in the quick settings menu if the buttons were smaller. You'd get more settings on a page, which means that you could get to your quick setting much faster.</p>\n<h2>Screen Touch Sensitivity</h2>\n<p>I'm putting this here because I think it's a software problem, but it could be hardware related, I don't know. Basically, when you do any swiping on the screen, it takes such an exaggerated motion to get the phone to actually follow through with it. I don't know how better to explain it other than sometimes when you swipe left or right, it won't actually follow through with the motion. It's very odd. It does have something to do with the haptic feedback because if you turn that off, the problem goes away. Hopefully, they fix that.</p>\n<h1>Software Updates</h1>\n<p>This is one area that I'm really excited about. Every other Android is so far behind what Google offers in terms of Android versions and it takes them so long to catch up. It's ridiculous. I love that I'll get the new stuff from Google on Day 1. It also comes with the risk of bugs, but I think that will be okay. I'll see if I still feel that way in a year.</p>\n<h1>Conclusions</h1>\n<p>I love this phone. I don't care for the software as much as I thought I would, but the hardware is so good and feels so nice in the hand that I can overlook my dislike of the look and feel of the software. Add on that I found that MagSafe is awesome and works great on an Android with a MagSafe case, and I'm finding that the Pixel is still my favorite phone that I've had in many years. If they can make the software even just a little better, I'd be so much happier.</p>\n<p>I hope everyone has a great week. If you're reading this on the website, you can get blog posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n",
      "date_published": "2023-01-22T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/goals/",
      "url": "https://thelinuxcast.org/posts/goals/",
      "title": "Goals For 2023",
      "content_html": "<p>Happy New Year.</p>\n<p>I know it has been a while since my last blog post, so sorry about that, but the holidays and RL were happening, so it just kind of fell by the wayside. Blogging weekly is something I hope to get back into this year.</p>\n<p>I hope everyone had a great holiday season. Mine was quite good. Spent a lot of time with family, which makes all the headaches worth it for sure.</p>\n<p>Now that we're entering a new year, I wanted to spend some time thinking about my goals professionally and personally and for YouTube. I separate out YouTube because it's still a hobby but it also feels like a job since I make some money doing it. It's kind of an odd place to be in, but it works out okay. Today I want to talk a bit about my goals for the channel this year.</p>\n<h1>A Video A Day Keeps the Algorithm Happy</h1>\n<p>My plan for this year is ambitious: one video every single day of the year. I've had a good streak going like this once before (right when I started the channel) but it fell by the wayside. It took a long time for me to be okay with taking days off, but eventually, I realized that the channel would still be here if I took a day off.</p>\n<p>But I like doing videos every day, so I'm going to give that a try. To do it, I'll need to get ahead, because I will still want some days off. My goal is to get significantly ahead over the next month so that I can always have videos on deck even if I don't feel like recording a new one.</p>\n<p>The biggest issue is that I'm awful at getting ahead. I've tried so many times, and I'll get ahead for a few days, and then I'll just stop making videos and the cache will go away. That's going to be something to avoid this time if I want to do this. I guess we'll see how it goes.</p>\n<p>My next goal is to start to change my content just a bit. I do too many frilly, no-substance, videos. I like my rants and such, and those won't go away, but I want to do some more stuff with substance. Tutorials, in-depth guides, maybe a few interviews, self-hosting stuff, and a little more on security and privacy, things like that. I'm also going to be learning Python this year, so maybe I'll do some programming videos as I progress, I don't know. I just know that I need to broaden my horizons a lot since some of my content lately has felt like reruns to me. I can bitch about RTFM-bros and how much I like #Fedora only so often before it just gets stale.</p>\n<p>Next, I want to blog more, so expect that to happen. I'm planning on at least once a week, but more likely I'll do two a week. Patrons will get all of these early. I will likely blog about many topics, not just Linux, but some general tech stuff too, so that should be fun.</p>\n<p>I'm also going to be doing a weekly Patron/Supporter-only podcast starting this week. It will be just a few minutes of me talking about something that interested me or caught my eye. The first episode of that should be out on Wednesday or thereabouts.</p>\n<p>Finally, I'm going to be starting up my weekly live streams again. Probably Sundays around 8PM ET. The first one I think will be tonight, so that should be fun. I do need to think about topics for those, though, because I can't just rice every single stream. As much as I really want to, of course.</p>\n<p>I hope that 2023 finds all of you well. I don't say it here often enough, but I thank each and every one of you for your support this last year and going forward. It truly means the world to me, and I can't thank you enough. As I say at the end of every video, you guys are awesome.</p>\n<p>Hope you have a safe and happy New Year,</p>\n<p>Matt</p>\n<p>If you read this on the website, you can get posts like this early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n",
      "date_published": "2023-01-12T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/NaNoWriMo/",
      "url": "https://thelinuxcast.org/posts/NaNoWriMo/",
      "title": "Thoughts On NaNoWriMo 2022",
      "content_html": "<p>So, I'm going to talk about writing today. I know it's not something that everyone is interested in, so I'll just keep my thoughts constrained to a blog post instead of making a video about it.</p>\n<p>I've been participating in NaNoWriMo since 2012. It is hard to believe that it has been 10 years, but it has. It is one of the events that I look forward to every year. For those of you who don't know, NaNoWriMo is National Novel Writing Month, though I think that it has become international at this point. The goal is to write 50,000 words during November. This is the average size of a small novel.</p>\n<p>As someone who writes for a living (though I mostly edit now, I suppose), I can tell you that 50,000 words of fiction is much harder to write than 50,000 words of non-fiction. Something about it being made up just makes it more difficult, more taxing.</p>\n<p>I've only ever won NaNo twice (you win if you get to 50K). I won this year for the second time.</p>\n<p>I always start off the month of November gung ho, with grand plans to torture my characters into submission. Some years, I do better than others. For example, there was a three-year span where I only wrote about 5k words the entire month because I kept changing my ideas. I'm mostly a pantser (someone who doesn't plan their stories but just writes it as it comes), which means that often if I try a story and it turns out to be a horrible idea, then I move on to another one. Some years, I try several ideas.</p>\n<p>In other years, I get about halfway through the goal, and then I just burn out. These are the years, usually, where I will write like 10k in the first day or two and then it just peters off until I abandon NaNo for that year.</p>\n<p>The point is, I know many people kind of scoff at the idea of NaNoWriMo. They don't understand or have no interest in it. I get that. I have no delusions about any of my work ever getting published (in fact, since I mostly write fanfiction, I know it won't get professionally published). Some people go into NaNo with the goal of writing something that will make them famous. Not me. I write for fun. Some years, when the words are flowing (like this year), it's amazing fun to take a story from a seed of an idea to something large and glorious. Others, when you're struggling to even put 10 words down on the page, can seem like torture.</p>\n<p>I write something non-work related every single day, but my biggest month is always November. I like to write, it is something I've enjoyed since I was in middle school and wrote a 100-page novella about the President of the United States and his dating woes (I was in eighth grade with all the problems eighth-graders have with girls, so of course, my main character, the most powerful man in the world, had the same teenage angst-ridden moments, the horror). Boy, was my 8th Grade English teacher shocked when she got that paper (it was supposed to be 10 pages worth of fiction).</p>\n<p>There is something about writing for pleasure that just brings out the best in me. I don't know if I'm even any good at it, but I don't care. It's fun and it makes me feel better about everything else that goes on in my life. I think it's that way for most people who have hobbies. They're escapes from the mundane tragedies of life. How poetic, Matt. Mundane tragedies. Sounds like a Guns N Roses album title.</p>\n<p>Meandered there a bit, didn't I? LOL.</p>\n<p>Anyhoo, NaNoWriMo is now ever. I got to 50k this year, and I'm quite happy with what I wrote, though it's an epic story and is nowhere near finished. But it was very fun and I am already looking forward to next year. (I may do Camp NaNo in April, that's an event where the goal is 25k). Should be fun. It almost always is.</p>\n<p>Hope everyone has a great week. If you're reading this on the blog, you can get these posts along with the occasional video earl by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-12-09T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/dvorak/",
      "url": "https://thelinuxcast.org/posts/dvorak/",
      "title": "I used Dvorak for a Week(ish)",
      "content_html": "<p>If you managed to catch this last week's pod, you know that Tyler was challenged to use Dvorak for two weeks. As the friend I am, I decided that I would take up that challenge alongside him. The one thing Tyler has at least discovered about this is that I'm a crappy cheerleader. Also, not much of a friend, since I abandoned him 6 days in.</p>\n<p>But you know how that goes. LOL.</p>\n<p>Anyway, I did switch to Dvorak for six days. And I have some thoughts, both about the keyboard layout itself and the process for switching away from your main everyday layout (mine is normally QWERTY). So let's get to it.</p>\n<p>First, thoughts on Dvorak itself. I actually kind of like it. During my six days with it, I got up to around 55 words per minute, which for just a few days is spectacular. I definitely learned it better than I did colemak, which I used for several weeks last year. Part of that success is that all of the most popular letters are on the home row. It made it really easy to learn words with those letters because your fingers hardly move around at all. It's very nice. And even lesser-used letters aren't that hard to get to or learn.</p>\n<p>There were a few problem keys. The major punctuation is all moved to the other side of the keyboard and to the top. So . and , are all in very odd places. It took some getting used to, but I actually, again, ended up liking it. I can see how it would be very useful to have those keys up top where they are easier to reach than below your right hand like normal.</p>\n<p>The thing that tripped me up, and which ultimately led to me going back to qwerty, is that the hard-coded shortcut keys for cut, copy, paste, save, and so on are all in completely different places. I tweeted about this and was reprimanded by some that I just needed to be more of a &quot;touch typist&quot; and learn to use the right modifier keys (ctrl mainly). I have arthritis in my right hand and it makes it hard for my hand to travel down to those keys. So, ctrl+s and ctrl+z and so on became two-handed operations. It was too hard to get used to, it just broke me out of any momentum I gained. I hit ctrl+s approximately 100 times a day if not more. I couldn't get used to using two hands to do it.</p>\n<p>Josh suggested that I remap that keybinding with VIA, and I tried, but it just wasn't the same.</p>\n<p>If I gave it like a month and had nothing else left to do in my life, no writing whatsoever, maybe I could have gotten past that final hurdle. But I write for a living. I guess I should say I edit for a living now as that is mostly what I do, but still. I sit in front of a computer and read and write and edit tens of thousands of words each day. So, I had to go back to qwerty.</p>\n<p>That all being said, I did enjoy my experience and I may try again someday. Learning how to type with a new layout is frustrating beyond all belief, but it is kind of fun, and I have to say, it makes me a better typist when I go back to qwerty. The one thing you have to do when you switch layouts is you have to <em>think</em> about how to press each key, which finger to use, and so on. It's not something you do with qwerty or whatever your main layout is because it has become second nature. Switching to another layout has gotten me to think about how I type in my main layout more. I realize that I don't use all of my fingers when I type normally and that I'm not on the traditional home keys all the time. I tend to have four fingers on hjkl instead of jkl; like you're supposed to. F@#k you vim, you've ruined everything.</p>\n<p>I also realize that I am not an accurate typist in qwerty. I tend to type really fast and ignore the typos until the end. Switching to another layout has made me more accurate in qwerty simply because again, I'm paying more attention to how my fingers are flying across the board.</p>\n<p>This experience has been overall a very good one for me, despite me having gone back to qwerty so fast. It has also made me think that I might give Colemak another try. That doesn't have the same issues with the hard-coded bindings that Dvorak has, since they're mostly in the same spots. So maybe I'll give that a try.</p>\n<p>The other thing that I wanted to talk about in regards to this switch and switch back, is that switching is kind of hard for other reasons than just learning where the letters are in your new layout. You have to relearn where your bindings are or, worse, you have to change the bindings. The vim keys, for example, move all over the damn place in Dvorak, and that's a problem for those who use vim. You can change those, of course, inside vim, but then you have to deal with those bindings when you are using a standard version of vim. Window manager bindings are also another problem. I ended up not making any changes, and just relearning the location of my previous bindings, but it took time and if I were to stick with any new layout, I'd definitely go through and redo all my bindings so that they made sense. Maybe something I should do with qwerty too since they don't make sense as is anyway.</p>\n<p>So those are my thoughts. I hope everyone has a great week. If you're reading this on the website, you can get early access to my blog posts and the occasional video by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-11-08T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/fedora/",
      "url": "https://thelinuxcast.org/posts/fedora/",
      "title": "Waiting For Everything to Go Wrong",
      "content_html": "<p>Four months with Fedora. I think part of my reason for writing this post and making as many videos about Fedora as I have in the last four months is that part of me wants to prove the nay-sayers wrong. See, I'm still here. I didn't distro hop.</p>\n<p>But, that's only a small part. The rest of it is that Fedora has just been so good. I have had a lot of luck when it comes to Linux. I don't think any of that luck is given to me because of some awesome knowledge of Linux. I'm a complete Linux noob for the most part, especially when compared to some people. So no, I'm not smarter than anyone else when it comes to Linux. But, as I say, I've had good luck with Linux. I've had my issues, but for the most part, when I distrohop, it's because I'm bored with a distro, not because of some fatal flaw.</p>\n<p>All that being said, Fedora remains the single best experience I've ever had on Linux. From installation to software selection, it has been spectacular. And stable beyond all my imagining. I thought that it'd be kinda flaky because of its experimental nature. But it really hasn't.</p>\n<p>And that all leads me up to the point of today's post: I'm waiting for the other shoe to drop, as they say. Every time I do an update, I expect my computer not to reboot or for something to go catastrophically wrong. With Arch, I was always aware that an update could come along and bork my computer. I was prepared for it, expected it even. It was just the way of doing business. I think most Arch users have that in the back of their heads when they update. Maybe not to the extent that I did, after all, I'm a huge cynic.</p>\n<p>On Fedora, however, it's been so good (and for so long, even if 4 months isn't that long), that I'm getting complacent. And that complacency has led to me being a fair bit paranoid. More than normal anyways. &quot;When is it going to break&quot; has become a mantra for me, I guess. The longer I go with Fedora, the more sure I am that eventually, my computer is going to puke its guts out.</p>\n<p>Will it happen? I'm convinced that it will. But maybe I'll get lucky.</p>\n<p>Fedora is a wonderful distro. I want so badly for this to be it. My distro. And it feels that way right now. But with them doing nonsense with video codecs and with the way they love to experiment with Fedora (it is, after all, its purpose), I don't know how long it will feel like that. And <em>that's</em> what's keeping me on my toes the most. That idea that sometime in the future, the Fedora devs will decide we need something new on Linux (maybe SystemD is too clunky) and decide to redo something, and my beloved Fedora will be no more.</p>\n<p>I'm a fanboy who expects the worse. It's an odd position to be in, to be sure.</p>\n<p>Hope everyone has a wonderful week. If you're reading this on the website, you can get these posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n",
      "date_published": "2022-10-20T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/q1review/",
      "url": "https://thelinuxcast.org/posts/q1review/",
      "title": "Keychron Q1 Version 2 Review",
      "content_html": "<p>Anyone who has followed me for any amount of time knows that I'm a keyboard nerd. I collect mechanical keyboards, and while I don't go crazy like some people in this space, I have more keyboards than I should.</p>\n<p>I got a new one. LOL.</p>\n<p>I decided that with the increased use of my standing desk that I was sick of the blue switches on my Vortex Race3. That board isn't hot-swap, so I was kind of stuck. Plus it is a micro USB, and I hate that. How we ever put up with that little annoying AF connector, I will never know. So I decided that I was going to upgrade.</p>\n<p>My initial inclination was to go custom like I did for my main desk. But I decided to save some money and get a pre-built. Not only would it save cash, but it would be easier. So I did some research, watched a few videos, and ended up buying the Keychron Q1.</p>\n<p>I've had a Kechron board before, and I hated it. The build quality was horrible, it had connectivity problems, and the Bluetooth never worked. It was just really, really bad. But supposedly, Keychron has gotten better over the last few years as they started to appeal to the more custom mech crowd. So, I bought the Q1v2, and I received it this past week, so I thought I'd give it a small review.</p>\n<p>First, the build quality of the actual board is amazing. The thing has to weigh close to 5lbs. It's nuts. It is heavier than the custom KBD75, which is itself a beast. It also flexes more than the kbd75, which has led to a much more comfy typing experience. I love it, and it has made going back to the kbd75 hard because that is a very stiff board.</p>\n<p>The one downside to the build quality of the Q1 is the keycaps. They are horrible. For a $200 board, the caps are cheap, thin, and plastic feeling. I've seen 30 buck boards that have better caps than the Q1, which is a travesty. I immediately took the caps off and replaced them with and cheap set I had lying around from Amazon. Instantly better. I can't believe that no one in their review of the Q1 talked about how cheap the caps feel. Makes me wonder if the company shipped out different caps to the reviewers than they do to the everyday consumer.</p>\n<p>In terms of sound, it is wonderful. If you like that clicky, thocc-y sound, the Q1 will be very good for you. It sounds better (once I replaced the keycaps) than every board I have except the kbd75 (which is a lot more expensive). I'm very happy with how it sounds. And the stabilizers are so much better than the Keychron that I had before. Those old ones rattled like crazy and you could tell that they had no lube whatsoever. The Q1 is completely the opposite. The stabilizers do not rattle at all and the actuation on all the stabilized keys is smooth. I love it.</p>\n<p>Overall, I really like this keyboard. I wouldn't tell anyone to buy it though unless they know that they'll immediately have to replace the keycaps. Which I think kind of removes one of this board's best features: the price. For $180, it is built like a $400 board. But the fact that they have to replace the caps if you want quality, will immediately increase the price by at least another 50 bucks. And when you get to $240 or more, there are custom kits out there around that price, and you can choose more about what your build includes. If you were to go with the Q1v2, I'd suggest going with the barebones version. Get your own switches and caps, and you'll have a custom that is better than the pre-built.</p>\n<p>My next keyboard investment, probably sometime next year, is going to be a split keyboard. It's time I tried one.</p>\n<p>Hope everyone has a good week! If you're reading this on the website, you can get early access to posts like this by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-10-03T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/ChangingSetups/",
      "url": "https://thelinuxcast.org/posts/ChangingSetups/",
      "title": "More Setup Changes",
      "content_html": "<p>Over the last week or so, I've been working on improving my setup. I've already written about <a href=\"https://thelinuxcast.org/posts/newmic/\">the new Microphone and the new audio interface</a> (both of which I'm really enjoying), but I've not talked about a couple other changes that I've decided to make.</p>\n<p>First, the monitor on my standing desk died. As you know if you've read the previous blog posts about this, I'm working on getting my standing desk set up so I can do some voice overs and some videos from there. When the monitor died, I decided it was time for some changes.</p>\n<p>I put one of the 27 inch HP monitors that have been on my main desk for a couple years on the standing desk. It is quite a change, as I'll talk about later. Then I ordered a 32 inch curved monitor from Sceptre. It's a lot bigger. I didn't think there would be that big a difference between 27 and 32. It looks like way more than 5 inches.</p>\n<p>The Sceptre monitor I bought is okay. I don't know the model number off hand, so I can't share that with you, but it was around $250. I chose this one because it was one of the only 32&quot; monitors that wasn't ultra widescreen. I don't have room for an ultra widescreen on my desk, not if I want to keep the other 27 inch monitor on my desk as well. Which I do. Eventually, I'm going to get a new desk, but that will be waiting until next year.</p>\n<p>I say the new monitor is only okay because I'm not quite happy with the contrast. Blacks on it are pretty washed out. I think I can fix that in the settings, but so far that has not happened. There doesn't seem to be an auto calibrate function like there is on my 8 year old HP 27&quot; monitors. Which I find disappointing.</p>\n<p>I'm also somewhat unhappy that I went with 1080p for the new monitor. I still say I can't tell the difference between this and something higher, but I've only seen 4k and 1440p in friend's offices, so maybe I would on my desk. I'm not too disappointed. I can't see pixels or anything.</p>\n<p>Right now the thing that is driving me nuts is that the second monitor, the 27&quot; looks so much smaller. The two side by side just do not fit well together. It makes me think I want a second 32&quot;, but I don't think even with the curved nature of them, that I'd be able to fit two 32s on my desk. I may try it anyways though in a few months.</p>\n<p>So yeah, my setup is slowly coming together. This will probably be the last change I make until I get my new desk next year, which I'm honestly quite happy about. Too much change and all that.</p>\n<p>On another note, I think I'm going to be spending a month in qtile. I still love i3, and I doubt very much that qtile will win me over, but for a video I'll spend some time with it and see if I can make it work as well as I have with i3. Maybe do some ricing and work on a ricing script for it. That should be fun and provide some content, so stay tuned for that.</p>\n<p>Hope everyone is having a nice week. If you are reading this on the website, you can get this along with the occasional video early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-09-26T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/twitterpopularity/",
      "url": "https://thelinuxcast.org/posts/twitterpopularity/",
      "title": "I&#39;m an Influencer. What Now?",
      "content_html": "<p>I have been a member of Twitter since 2009. I will be completely honest and say for the first, oh, I don't know, 5 years or so, I was mostly the type of Twitter user who posted things like &quot;I'm home&quot; and &quot;Here's my dinner&quot;.</p>\n<p>Very exciting stuff, let me tell you.</p>\n<p>But even then, I had high aspirations. As anyone can attest who was around in those early days of social media, it was a common dream to have a large following of people who waited with bated breaths for your next amazing post. I don't really know how I was expecting to get that type of following with the type of inane content I was posting, but I still had those dreams. And it wasn't just Twitter. I used every social platform at the time in pretty much the same way. (The only exception, kinda, being Facebook, where I had been since 2004. At the time, that was still more about family connections than anything else).</p>\n<p>Obviously, fame and social standing never happened for me on my @mtwb twitter account. (still inordinately proud of having a four letter handle). The most followers I ever achieved was around 1,000, and that was only because I joined up with a political follow-back thing that encouraged all of their memebers to follow each other back. I eventually stopped the political thing and unfollowed everyone I had followed, which, of course, led to my follower count going way down.</p>\n<p>Even now, no my main, personal account on Twitter, I have only around 900 followers, the vast majority of whom are probably bots. Every once in a while I'll get a post that gets 10 or 12 likes, but that is pretty rare. I do have a few people on that account that I interact with, but mostly I use it for following my fanfiction peeps and a few friends from school.</p>\n<p>In 2017, I created The Linux Cast. Ricky, on of my online friends, and I decided to create the Linux podcast so we could nerd out together about Linux. We carried on for almost a year or so. I created <a href=\"https://twitter.com/thelinuxcast\">@thelinuxcast</a> then. I think I had about 20 followers for the entire first two years of the pod.</p>\n<p>After those two years, the Linux pod laid dormant. Ricky and I got busy with other things, and while I still used Linux full time, Ricky will always been an Apple fanboy. In 2020, when I went to Anchor (where I host both of my podcasts), I noticed that people were actually listening to those old episodes of The Linux Cast. That spurred me to start back up.</p>\n<p>The success of the YouTube channel has been phenomenal. There isn't a day that goes by that I don't shake my head at the success that I've had. I mean, I'm not DT or Chris Titus, but 20k is a ton of people. 20,000 people have subscribed to my channel. Just thinking about it makes me a bit dizzy, tbh.</p>\n<p>The thing that came with that YouTube success, however, is the thing that back in 2009, I wanted the most: Twitter fame. Okay, maybe not fame, but I now have 1500 followers on Twitter (not even a ton more than I've had on my main account for years), but the difference is that I have true interaction on @thelinuxcast more than I ever did on my personal account. People like and retweet and reply on my Tweets a ton. Just this morning I woke up and had over 100 mentions, some of them from actual, big time Linux YouTubers, as they were discussing a Tweet I made about AppImages.</p>\n<p>It feels so odd, whether it is on Twitter or YouTube or on Discord, for people to actually <em>care</em> what I have to say. I'm just a nerd from the mid-west, playing on his computer all damn day. That 'fame' I wanted in 2009, now that it's here ish, seems so odd. If anyone called me an influencer, I'd probably cuss them out, but this must be a tiny bit what those actual people with influence feel like every day, just on a far grander scale. I can't imagine having 100,000 followers on Twitter. Or a million. That'd be crazy and I have no clue how I'd handle that. As is, it feels surreal, I can't imagine what more would feel like.</p>\n<p>I find that the bigger I get on social media, the more I strive to not care how big I get on social media. No longer do I want internet fame. Don't get me wrong, I love that people subscribe to my channel, and I want them to continue doing so, but I no longer just want to be popular for popularity's sake. I want to be known for a good reason. I want people to follow or subscribe because I helped them or they find my stuff interesting. Just getting a ton of subscribers/followers for the sake of being influential, just kind of makes me sick and ashamed of my younger self who very much wanted that. Now, as I gain followers for a good reason, I think that's a much better way to go about it.</p>\n<p>And to go back to the not caring bit, I also find that it's a mental health thing too. Even when I first started off with YouTubing (not a word), I was obsessed with getting more and more subs. Now, I still check my subscriber count a few times a day (mostly I just see it passing by as I go towards the content view of YouTube studio), but I no longer have to check it 10 times an hour to see if I got one more subscriber. It's made the whole thing a lot more fun for me. I can make my videos and tweet my tweets, without doing it for what seem like the wrong reasons. And as I continue to do that, I think my videos will keep getting better.</p>\n<p>Anyways, those are some brief thoughts on my Social Media journey. I hope everyone has a great week. If you're reading this on the website, you can get early access to posts like this and the occasional video by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-09-20T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/newmic/",
      "url": "https://thelinuxcast.org/posts/newmic/",
      "title": "I Bought a New Microphone",
      "content_html": "<p>So I've purchased a new microphone. I've spent the last few days researching and in the end I decided to go with the Shure SM7b. I know that it's a cliche podcaster/YouTuber microphone, but I don't care all that much. People use it for a reason. It's really good.</p>\n<p>The other option was the EV RE20, which is the slightly cheaper brother to the microphone that DistroTube uses. I really liked that mic, but it requires a shock mount that is another $100 on top of the cost of the microphone. I decided to save myself a hundred bucks.</p>\n<p>I suppose I should talk about why I decided to go with a new mic. I've been using the Heil PR40 for the last 10 years. (I've been podcasting since 2009). It's a good microphone and is still working fairly well. I've decided to start doing some of my videos from my standing desk, so the PR40 will be moving over there. And the SM7b will be at my main machine. Really that's all it boils down to, I wanted a good mic over on my standing desk.</p>\n<p>I also bought a new audio interface. I chose the UA Volt 276, which I hope will work fairly well with Linux. I don't see a reason why it shouldn't since all the processing I care about will happen on device. It has a nice built in analog compressor and a vintage mode which is supposed to sound really nice. A bit pricey, but that built in compressor really sold it for me. That will be sticking around with the SM7b, while my Scarlet Solo is going to go over to the standing desk. I also bought a fethed, which seems to be a must for the Shure. I again decided to save money there instead of paying almost double for a Cloudlifter.</p>\n<p>The one thing they tell you about being a YouTuber is to not get too invested into gear. I did a pretty good job of this up until now, to be honest. The Heil PR40 I already had, so that wasn't for the channel. And while I've bought things like headphones to make editing easier, I haven't spend a ton of money to make my set up better (despite some temptation to do so). I think now that I've done this for two years a relatively small investment in some equipment, to help my work flow a bit (I really want to use my standing desk more), is perfectly fine.</p>\n<p>My biggest hope is that I don't regret not going with the RE20. I really like the look of that microphone, but I had to remind myself that it really doesn't matter how a mic looks, just that it sounds good. From the sound tests I listened to, I just could not tell the difference between them. I'm not an audiophile at all, so that's not that surprising, but I figured saving the extra cash was a better choice, at least at the moment. Of course, if I hate the SM7b, I'll exchange it for the RE20. I guess we'll see how that turns out.</p>\n<p>I hope your week is going well. If you're reading this on the website, you can get these blog posts along with the occasional video early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreo</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-09-12T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/workspaces/",
      "url": "https://thelinuxcast.org/posts/workspaces/",
      "title": "I Used 10 Workspaces for 48 Hours",
      "content_html": "<p>I think anyone who has watched my content for any period of time knows that I have a workspace problem. I use a ton of them, so much so that it has kind of become a meme. Often times I have content on 14-15 workspaces at a time. I've talked about this and the reason why I work this way in several videos, so this isn't news to anyone who has watched my videos for some time.</p>\n<p>However, I do realize that it can sometimes get in the way of my productivity, especially when I have so many workspaces open for so many days that I can't remember what is where. A few days ago, I was in such a situation. My computer had been up for a few days at that point, as I was working on several projects at once, and I had stuff on 18 of the 19 workspaces. It was a mess and way overboard. So I decided then, that I would try to go down to 10 workspaces shared between my two monitors and see if I could get in the habit of working with that number of desktops.</p>\n<p>I had hoped that this would give me a couple advantages. First, I'd get better at closing up windows and apps that I'm not using (and maybe shutting my computer off at night, which I don't often do because it also serves as my Plex server), and second, I had hoped that it would allow me to do some tweaking to a few of my polybar configs. I want to start using icons in place of workspace numbers on some of my rices, and that's hard to do when I have 19 workspaces and not all of them are dedicated to one task.</p>\n<p>So I tried this for over 48 hours (you should honestly be proud that I made it that long). It was a disaster for my productivity. Maybe if I could have stuck it out for a week I'd have gotten used to it, but I just could get nothing done. It felt like I had no room to breathe. All 10 workspaces were constantly full, which meant I had no new workspaces to work with. It was a horrible feeling.</p>\n<p>I know it sounds like I'm being hyperbolic, but it's true. It was a horrible experience.</p>\n<p>I get people asking me why I need so many workspaces, and I always say it's just the way I work, but I don't think I really knew the answer until I did this little experiment. I like having a place for everything. I have one or two workspaces that are always dedicated to instances of Firefox or whatever browser I'm using. I have one for my todo app. I have one for discord. One for Krusader. Three or four that have terminals open on them with various apps that I find myself constantly using (things like vim and such). One for Thunderbird. One for Marktext. You get the idea.</p>\n<p>And I'm the type of person who leaves this stuff open all the time. I know that most people probably close their apps when they're done with them, but I know that I'm going to be coming back. And my attention span is such that I often do three or four things at once. (For example, I'm writing this right now, ricing i3 (shocker), and watching master check and Justified all at the same time) I switch from one task to another bam bam bam. It's how I've always worked. It may not be elegant or healthy, but it works for me.</p>\n<p>So when I went to 10 workspaces, I felt like I lost a part of my productivity space. The places I had dedicated to certain apps or uses were now forced to share that space with another app or sometimes two. It just did not work for me, and to be honest, it made me uncomfortable and highly unproductive.</p>\n<p>So, after 48 and a few hours, I switched back to my 19 workspace set up on i3. It feels like I can breath again, and I'm much happier. I've gotten so much more work done today than I have in the last two it's not even funny. So yeah, a lot of workspaces is going to be the way I go. I guess as long as it doesn't hurt anything, it doesn't matter.</p>\n<p>If you're reading this on the website, you can get these posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>I hope everyone has a great week,</p>\n<p>Matt</p>\n",
      "date_published": "2022-09-05T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/MobileAndroidEmailSucks/",
      "url": "https://thelinuxcast.org/posts/MobileAndroidEmailSucks/",
      "title": "Mobile Email Sucks Donkey Balls",
      "content_html": "<p>Most of my email use is actually on my phone. I've never found an email client on Linux that I really like (I use Thunderbird, but it has so many issues). When I'm on iOS, the email clients are great and plentiful.</p>\n<p>And while there are many email clients on Android, there aren't many good ones, or at least not any good ones that don't also come with a huge caveat (which I'll talk about later).</p>\n<p>For years, I've been using <a href=\"https://play.google.com/store/apps/details?id=com.ninefolders.hd3&amp;hl=en_US&amp;gl=US\">Nine</a>, and it's a really good app, but I've been using multiple email accounts for a few months now and the unified inbox that Nine offers is just not great. Mostly because you can't set it as your default view, which means you have to constantly switch back to it after reading a message or managing your messages. That is annoying AF.</p>\n<p>So, I've been looking for something different. I really only have three needs when it comes to an app for email: it has to have a good, default unified inbox (which means multi-account support is a must), it has to be customizable (I like to be able to tweak colors and change the quick actions in the notifications), and it has to be good looking or at least well enough designed that it isn't off putting.</p>\n<p>That last one is honestly the hardest thing to find. iOS does such a better job when it comes to app design. There are so many on Android that just look like utter garbage. I tried K9, because I thought open source was a good idea, but it is so dated and doesn't have many features that I've come to expect (like swiping to delete and so on). So that was a no go.</p>\n<p>Over the last few days, I've probably tried 10 different clients. And there have been a few that I thought would be okay. Spike and AquaMail were both really nice, though AquaMail wasn't that great looking out of the box. The issue is that both of them had that caveat I mentioned earlier, and that is their paid plans. And that brings me to the meat of the story.</p>\n<p>It turns out that developers need to make money. This is something I've talked about on the channel before when it comes to Linux and Open Source. I understand this, and I'm quite happy to pay for an application when I like it and use it. I'm not made of money, but when I can, I will gladly pay money for an app. I'll even pay exorbitant amounts for an app if I really like it. (I paid 40 bucks for a Twitter client once, I shit you not). What I will not do is pay $100 a year for an email client. It seems that every email client on Android that is actually any good has a pro plan that costs an arm and a leg.</p>\n<p>I hate subscription services for apps. I can get behind a subscription service for a service (Netflix and a VPN or something), but for an App, I can't stand it. It's one of the reasons why I would never use Photoshop or Adobe Premier. I will never pay $70 a month for an app. Just let me buy it. I've proven that I'm not unwilling to spend a load of money for an app if it is good and useful. Hell, I even paid 200 bucks for the Adobe suite back in the day (in college). I won't pay for that money month to month.</p>\n<p>Add on top of all that, the 'perks' that these email clients offer are just horrible. The two I mentioned above, Spike and AquaMail, hide features that should be a basic part of their client, behind their paywall. Specifically, AquaMail doesn't offer you multi-account support without giving them $14.99 a month or something like that. That's nuts.</p>\n<p>In the end I did find an app. It's called Email from Edison Software. And it's beautifully designed and has all the features I need. It does have a pro plan for $100 a year, but they have at least not hidden the necessary features behind that plan, so I can just use it for free. I wish they didn't have the subscription plan, because I'd gladly throw them 20 bucks or something. I just refuse to do it every month.</p>\n<p>I hope everyone is doing well. If you're reading this on the website, you can get all of these blog posts early by supporting me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Have a good week,</p>\n<p>Matt</p>\n",
      "date_published": "2022-08-31T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/ideas/",
      "url": "https://thelinuxcast.org/posts/ideas/",
      "title": "Lacking Ideas",
      "content_html": "<p>I don't know if you guys have noticed or not, but sometimes the videos that come out on the channel are a bit lackluster. I do try to come up with and produce good content.</p>\n<p>But nobody can create good content all the time. Sometimes there are stinkers.</p>\n<p>I'll admit that the absolute hardest part of doing this is the ideas behind the content. Coming up with new ideas, especially when you put out as many videos as I do, is really effin' hard. So, yeah, there are quite a few videos that are on topics that just kind of flop.</p>\n<p>It doesn't bother me as much as it used to. In the early days, when I put out a stinker, I'd be a bit depressed about it. Unhappy that no one wanted to watch it. Angry sometimes too, because sometimes the stinkers weren't throw away videos, but were instead videos that I had put quite a bit of effort into.</p>\n<p>Nowadays, I don't care as much. I know now, from experience, that sometimes videos flop. I've even gotten pretty good at recognizing when a video is unlikely to do well. Either it's a topic that just won't appeal to many or I've done it too often. Because I have gotten a little repetitive. I've noticed in some of my more noob-friendly videos that I've been repeating myself a bit too much.</p>\n<p>It is something I need to improve on. And I have started to think about doing some more app and distro based videos. Maybe a few more tutorials. Fewer rants (don't worry those won't ever go away entirely), things like that.</p>\n<p>Another problem is that because I've done so many videos (Over 500 so far), I've forgotten which one's I've done in the past. So I've found myself a couple times redoing videos I've already actually posted. So that's another thing that I'm going to have to keep track of, or at least do a better job of keeping track of.</p>\n<p>Anyways, I guess the point this week is that I'm sometimes out of ideas, that's why you'll see the occasional stinker on the channel.</p>\n<p>Hope everyone has a great week. If you're reading this on the website, all my blog post are released a week early for patrons. Check that out <a href=\"https://patreon.com/thelinuxcast\">here</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-08-01T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/i_love_fedora/",
      "url": "https://thelinuxcast.org/posts/i_love_fedora/",
      "title": "I Love Fedora",
      "content_html": "<p>So a couple of weeks ago, my Arch system sh^t the bed. Most of the issues where were my fault. Turns out uninstalling Plasma from a Plasma Distro is not a great idea. Who knew? Or maybe I knew, and I did it anyways, because I do what I want, b*tches. Sorry, too much South Park.</p>\n<p>Anyways, after that happened, I decided that I needed to move away from Arch. I know from some of the snarky comments I received on YouTube that a lot of people had no faith that I would leave Arch behind for good. Maybe, just maybe, I've cultivated such an unfair reputation. I dunno.</p>\n<p>Fedora ended up being my destination. I started out with the workstation iso and spent a week there. It was spectacular. So spectacular, that is, that I decided to nuke it and install the KDE spin. I did it for good reasons though, which I will get into in a bit.</p>\n<p>Once there, I've had so much fun. One of the things I think is absolutely true, at least for me, is that Arch kind of makes you lazy. Yes, problems arise, but they're mostly the same problems over and over again. Add on top of that, the AUR makes it so easy to get software that you kind of forget what it's like to have to actually hunt for the things you need.</p>\n<p>Now, that's not to say that the AUR is bad. Of course it's great that you can install something so easy. But outside of the Arch ecosystem, you have to actually work for it. That feeling of accomplishment that you get when you do it yourself, is not worth nothing.</p>\n<p><a href=\"https://thelinuxcast.org/img/everforest.png\"><img src=\"https://thelinuxcast.org/img/everforest.png\" alt=\"everforest\" /></a></p>\n<p>Getting Fedora set up and working the way I want to has just been a joy. I don't think I've had this much fun on Linux since I started. Add on top of that that the experience, outside of a couple things, has been so utterly painless that I can't even remember the last time I've had such an easy go of actually using a distribution.</p>\n<p>There have only been two problems. First, the ongoing one, is that when I log out of i3wm, it hangs at the wallpaper and never brings up SDDM. I'm unsure what the issue is here, to be honest. And I'm not sure I care. I don't log out all that much. It just means I can't easily change sessions. I don't have the same issue when logging out of Plasma, so it must be an i3 thing.</p>\n<p>The second problem was one that drove me crazy, and that was for some reason, every app was defaulting to the GTK+ file picker. And while normally I wouldn't are, the GTK file picker on Fedora is broken AF. You go to type in a file name when in the save dialogue, and instead of letting you type the name, it assumes you want to search. As I said, annoying. It wouldn't have even been a big deal, as the only place I really save files with a file picker is Kdenlive.</p>\n<p>You'd think that, being a QT app, it'd use the QT file picker. Nope.</p>\n<p>I struggled with this on both the Workstation version of Fedora and the KDE spin. Eventually, I solved it. I just uninstalled the gnome and gtk destkop portals. IDK if that was the best solution or not, but it worked and I have had no issues since then, so it didn't break anything.</p>\n<p>Outside of those two relatively minor issues, Fedora has been wonderful. DNF, after enabling parallel downloads, has been very good. And the selection of software in the repos has been better than I expected. There have been several things I haven't been able to get, that I needed to build (eleventy, a few rofi things) but most stuff is there. And COPR, despite what I said on camera, is nice to have. A bit convoluted and a bit too much like PPAs, but still nice to have.</p>\n<p>Overall, Fedora has been great. I'm over 2 weeks of using it and I don't see myself switching away unless something horrible goes wrong. And even then, I'm going to try to solve the problems I have instead of hopping. I want stability and consistency in my old age, I guess.</p>\n<p>I hope everyone is having a fine week. If you're reading this on the website, you can get all my blog posts early by supporting me on any level over on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-07-22T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/in_defense_of_ricing/",
      "url": "https://thelinuxcast.org/posts/in_defense_of_ricing/",
      "title": "In Defense of Ricing",
      "content_html": "<p>I get a lot of comments about how dumb it is to constantly change the look of my setup, that I spend too much time customizing the look and feel and not enough time working. Almost every video I've ever done that has something to do with ricing has at least one comment like that.</p>\n<p><a href=\"https://thelinuxcast.org/img/rice1.png\"><img src=\"https://thelinuxcast.org/img/rice1.png\" alt=\"rice1\" /></a></p>\n<p>The thing is, I like ricing. I've talked about this in a video before. I know that I do spend too much time customizing my window manager, but I don't care. I <em>enjoy</em> ricing. When it comes to hobbies, I don't think this is a bad one. For sure there are worse ones to have.</p>\n<p>And because I look at my computer screen for so many hours, every single day of the week, I want to look at something that is nice looking. Maybe I'd be more productive if I was running something that was just black and white with no frills. Maybe. I doubt it though. I'd be bored and unhappy with such a set up.</p>\n<p>Not that I disparage people from actually doing that if that type of setup suits them. It's just not for me.</p>\n<p>One of the coolest things I've done is written my configs in such a way that I can change two lines and switch to a completely different theme. It saves loads of time. So, yes, I created the theme, but once it's created I can save it and switch between it and all the others that I've created.</p>\n<p>I don't consider it a waste of time. To be honest, it may not be productive time, but it was time that I enjoyed. It's like any other hobby. It may not be something you can turn into billable hours, but if you enjoy it, that's what matters.</p>\n<p>So I don't understand the people who find Ricing a waste of time. If it's not for them, that's fine. But I enjoy it.</p>\n<p>Not much of a blog post, but I needed to talk about it, so there you go. If you're reading this on the website and would like to get these blog posts early (along with the occasional early video) you can support me on <a href=\"https://patreon.com/thelinuxcast\">Patreon</a>.</p>\n<p>Hope everyone has a great week,</p>\n<p>Matt</p>\n",
      "date_published": "2022-07-21T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/Updating_Site/",
      "url": "https://thelinuxcast.org/posts/Updating_Site/",
      "title": "Update on the Website",
      "content_html": "<p>It has been a bit since my last blog post. The website was such a pain in the bum to update, I just didn't bother writing.</p>\n<p>Luckily, thanks to Joris, that is a think of the past.</p>\n<p>Joris has spent time setting me up with a brand new website back end based on Eleventy. It means I can write my posts here in Markdown and not have to use pandoc to go to html and then update the site manually through it. It's all done with a handy-dandy script. Totally awesome.</p>\n<p>So, that should mean that blog posts will be coming back as a weekly thing. I'll still release them early for patrons, which is something I've been slacking on lately, so check out <a href=\"https://patreon.com/thelinuxcast\" title=\"Patreon Link\">there</a> if you want to see posts early.</p>\n<p>Also, check out Joris' <a href=\"https://jorisvandijk.com/\">site</a>. He's got some great blog posts over there.</p>\n<p>Hope everyone has a good week,</p>\n<p>Matt</p>\n",
      "date_published": "2022-07-11T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/0005/",
      "url": "https://thelinuxcast.org/posts/0005/",
      "title": "An Essay on YouTube Mental Health",
      "content_html": "<p>I've been creating videos now on YouTube since September 2020. While that doesn't seem like all that long, in that time I've created over 400 videos, had over 1,000,000 views, and I'm really close to 10,000 subscribers. So, I think that I am qualified enough to talk about some YouTube stuff.</p>\n<p>I call it stuff because talking about Mental Health is always uncomfortable. Nobody likes doing it, and nobody likes listening to it because it makes us all think about our own struggles with emotions and the everyday grind of life in the Real World.</p>\n<p>One of the problems I deal with outside of the YouTube world is motivation. It is something that has always been a problem for me. I joke a lot that I'm the laziest bastard this side of the Mississippi, but I really do have times where I just have no interest in doing anything. More times than I'd like to admit to, really.</p>\n<p>I say this because that laziness often peaks it head into the YouTube world as well. A lot. Pesky little bugger.</p>\n<p>Maintaining a YouTube channel that puts out a video almost every single day has definitely tested my ability to stay motivated. Add on top that this is <em>not</em> my job and it has been especially hard some days to even think about making a video.</p>\n<p>So, it is perhaps unsurprising, that there are certain aspects of being a 'YouTuber' that can make it even harder to continue on.</p>\n<p>The biggest thing is, obviously, views. There is no predicting what video will do really well and which one will flop. You can spend 4 days recording and editing a video and it will be a complete failure, while at the same time spend 15 minutes on a video and it will get 10,000 views.</p>\n<p>Even Mr. Beast can't predict the YouTube algorithm, though he definitely does a better job of it than almost anyone else. So, it's not surprising that I can't do a good job of it.</p>\n<p>The issue is that because of this unpredictability, there are times when you get two or three videos in a row that just flop. There's no reason why, they just do. Even if you thought that they'd do well, and are topics that you thought would be appealing to a lot of your audience, they just flop.</p>\n<p>And that brings us back to motivation.</p>\n<p>There is no feeling worse than signing into YouTube studio (the backend that YouTube provides for creators) and seeing that the video you uploaded an hour before is the 10th video in terms of views out of the last 10 you published. It gets even worse when you have days like this in a row, where no video seems to be good enough.</p>\n<p>Fighting through that is so, so hard. The voice in my head gets pissy, of course. &quot;Why the fuck do I make videos? Ungrateful little assholes.&quot; Not that it's anyone's fault. It's hard not to think that way. It's hard not to get greedy when things are going well, and just come to assume that things will continue to go well.</p>\n<p>There are no guarantees on YouTube. That's for sure.</p>\n<p>The constant worry of failure is ever present. If you see that dreaded 10/10 it is really hard not to think that it's <em>you</em> who has done something wrong. Have that happen for multiple days in a row and it is impossible to not to think about how your channel is dying and that all the work you've put in for years has been for nothing.</p>\n<p>The toll it takes is vast and something that is not talked about enough. Sure, creating content on YouTube is not a hard job. I never will say that. There are jobs out there that are dangerous, physically demanding, and more mentally taxing. However, just because YouTube Content Creator isn't something that Mike Rowe would do, doesn't mean it can't be a contributor to depression and stress.</p>\n<p>Since 2020, I've experienced this depression multiple times. Sometimes several times in the same day. The up and down nature of being able to constantly plug into real-time stats makes it really easy to see when something isn't going as well as you had hoped it would. And when that happens, feeling down about it is inevitable.</p>\n<p>I've tried multiple times to remove the studio app from my phone, prevent myself from visiting the website, all in the hopes that I won't become so attached to watching the views and subscribers go up and down and up and down. And I have gotten better. When I first really started getting views (I mean any at all. I was so happy when I started to get 10 views a video), I checked every 2-5 minutes. It was an obsession.</p>\n<p>Luckily, I don't do that now. I still check once and hour or so, and that's too often. (I do so more often right after a video has been published). But the need to look and see how things are going is strong and hard to fight against.</p>\n<p>Motivation. That's where I started off this little talk. And it's where I'll end. Maintaining motivation and having fun creating content are essential if you want to be successful on YouTube (no matter what measure of success you're using). Losing interest in what you're doing can be devastating and make you feel like you're a complete failure and that nothing you ever do will be good enough.</p>\n<p>Seeing constant statistics that tell you that you're latest videos have bombed just make you feel like you want to give up. Add on top of that the trolls and the meanness that exists in every content section, and it's no wonder that so many YouTubers give up after a year or so, no matter the success they've found.</p>\n<p>For me, the only thing I've found that works is to reset myself. To go and do a video that I want to do and that I don't give a damn how it does. Something exotic or so niche that nobody would ever watch it. But I do it anyways because it reminds me that I'm not doing this for the money or to be the next Mr. Beast. I started this because I thought it would be fun and I wanted to talk about Linux and Tech. Reminding myself of those reasons makes everything else not matter so much.</p>\n<p>At the end of the day, YouTube is stressful. I have to constantly remind myself that if a couple videos don't do well, that it's okay and that the next one will be better. Hopefully. That hope that eventually you'll get out of your slump is just enough, most  days, to keep the motivation high enough to create another video.</p>\n<p>Some days.</p>\n<p>I hope everyone is having a great week. If you would like to get these blog posts a week early, you can support me on Patreon <a href=\"https://www.patreon.com/thelinuxcast\">here</a>.</p>\n<p>Matt</p>\n",
      "date_published": "2022-06-09T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/0004/",
      "url": "https://thelinuxcast.org/posts/0004/",
      "title": "Audio Still Sucks on Linux",
      "content_html": "<p>On this past Sunday night (or a week ago Sunday if you’re not a patron), I had a huge plan. I was going to rice i3wm over and over again, creating several themes. It’s something I did for DWM and wanted (and still want) to do for i3 now that i3wm is my daily driver again.</p>\n<p>The problem is that once I got streaming, no one could hear me. And I was like what the F$#k? My audio had been working fine. Tyler and I had even done a podcast a few days before that and everything worked fine during that stream.</p>\n<p>The only thing that changed was that there was an update to pipewire on Arch.</p>\n<p>Yeah. Pipewire. That piece of crap.</p>\n<p>So, I did some trouble shooting, and found that for some reason, my input/output sources were going wonky. At least one was connecting and reconnecting randomly for no apparent reason. If it was just one source, I would have thought that it was that source going bad or needing to be rebooted. But it wasn’t. One time it was one source, the next it was another. It was effing odd.</p>\n<p>Add on top of that, OBS was trying to make my amp/dac an input device, even though it’s, like, totally not an input device. This is a problem I had with Pipewire once before on Arch, so obviously this is something that happens a lot.</p>\n<p>It is infuriating.</p>\n<p>So, I decided to hop. I moved away from Vanilla Arch and decided to go to MX Linux. I figure that I won’t have to deal with random updates that break crap on a Debian-based distro.</p>\n<p>Of course, it wouldn’t get past grub once I installed it. For f#$! sake.</p>\n<p>After hours of messing around, I was about this close  , from just saying eff my Linux career, eff the YouTube Channel, eff everything, I’m installing Windows.</p>\n<p>You think I’m kidding, but it’s true. I was so, so angry. Nothing was going right.</p>\n<p>In the end, I ended up back on Arco. Arco seems to always treat me right and I enjoy their community more than any other. I get everything set back up on my system, all my apps installed, all my files back on the HDD, and what happens?</p>\n<p>Same damn audio issue.</p>\n<p>Yeah.</p>\n<p>I did get it so that it will work, but for some reason, Pavucontrol/pulsemixer still wants to do some odd things. If I have it in my normal configuration, It wants to assigned my amp/dac to be an input device. But in OBS’s audio level indicator everything seems fine. If I go into pulsemixer/pavucontrol and change all my inputs to my Scarlet Solo, as it should be, then OBS thinks that the Desktop Audio (which is an Output) is actually a mono input. WTF?</p>\n<p>Linux audio sucks. And I’ve said this before, but Pipewire actually makes audio on Linux suck unless you’re getting into Jack or something. If you’re just a normal audio user, Pipewire is still broken. Linux is 31 years old. Audio should not still be a problem.</p>\n<p>Of course, I could uninstall pipewire. But it turns out doing that actually is harder than uninstalling snaps on Ubuntu. It’s tied into everything. And I mean everything. You have to remove like 20 packages, some of them essential, to get it to go away. It’s infuriating.</p>\n<p>Anyways, it has not been a great week on Linux for me. Here’s hoping that the audio works fine for the pod on Thursday. But I’m not going to hold my breath.</p>\n<p>If you'd like to see these blog posts a week early, you can support me on Patreon here.</p>\n<p>Matt</p>\n",
      "date_published": "2022-06-08T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/0003/",
      "url": "https://thelinuxcast.org/posts/0003/",
      "title": "I Like Flatpaks",
      "content_html": "<p>My love affair with the AUR is well documented. It's so bad I can't use anything that's not Arch-based on my main computer. Without the AUR, I just feel lost and without all of my lovely programs.</p>\n<p>(I'm really not without them, of course. The repos on Debian/Ubuntu/MX are great for the most part)</p>\n<p>Even with that love affair still going strong, I find myself enjoying Flatpaks more and more. Some of this is some recent problems with building some apps from the AUR. Honestly, the problems have surprised me because for years, the AUR has been mostly flawless for me. I don't think I've ever encountered a major problem prior to the last couple weeks.</p>\n<p>With those problems, I had to turn to other sources. I refuse to use Snaps. I can't stand them, and despite what @DistroTube says, I think it's perfectly fine for me to hate them. I don't like loopback devices cluttering my lsblk or a Snap directory permanently being placed in my $HOME directory.</p>\n<p>So, I chose Flatpaks. And, I have to say, it has been a surprisingly good experience so far. I'm using the Audacity, GIMP and OBS flatpaks so far. The Audacity one seems to be the only way to get a 3.0+ version of Audacity without building it on Arch. I know that it has telemetry and I really don't like it, but I have a ton of project files with the new .aup file format, and pre 3.0 Audacity can't handle those. (Thank you Audacium for getting me onto that format and then breaking so I can't build you.)</p>\n<p>By far the best experience is the OBS flatpak. I didn't know that the OBS package on Arch was so handicapped. Now I get access to chat panels and so much more, and it's awesome.</p>\n<p>While I'm sure that there are downsides to Flatpaks (themeing still seems to be a problem), I have enjoyed just being able to download an app without having to watch my terminal download a ton of dependencies, all of which add to my package count (not that that really matters, but it's something my brain notices). I also have enjoyed not having to wait for my computer to build the packages.</p>\n<p>The only real problem I have is that the classes for the Flatpaks are wrong. You can't go into sxhkd and assign a binding to gimp anymore, it has to be com.gimp.whatever and it's a mess. We've had classes for decades, can we please not come up with something else that is legitimately worse?</p>\n<p>The real question is, will this newfound interest in flatpaks enable me to move away from Arch Linux? After all, the primary feature that I love most about Arch is the AUR. If I no longer need it, does that mean I can go to something like, I don't know, Solus and be happy there? Something to think about I guess.</p>\n<p>Hope everyone has a nice week, even with all the idiocy that is going on in the world right now.</p>\n<p>If you'd like these blog posts a week early, you can support me on Patreon here.</p>\n<p>Matt</p>\n",
      "date_published": "2022-06-07T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/0002/",
      "url": "https://thelinuxcast.org/posts/0002/",
      "title": "I Bought The Apple Watch… And It Kind of Sucks",
      "content_html": "<p>In an effort to start to move around more and become more healthy, I decided that I would do the nerd thing and buy a gadget to keep track of health and fitness metrics. Because I switched to the iPhone - and from everything I read, Android watches suck - I decided I would pick up an Apple Watch.</p>\n<p>I’ve been using this thing now for a week, and I thought I’d write about my experiences so far.</p>\n<p>First, I have never really worn a watch for any length of time before, so getting used to it has been a chore. I am finally getting there, but every time the damn thing buzzes with a notification, I startle. It’s kind of entertaining to watch. LOL.</p>\n<p>But the main functionality that I bought it for has been disappointing. The biggest issue is that it is so inaccurate that it’s almost funny. The pedometer, for example, often states I have walked 10 miles during the day. Like, that’s not even possible. If it said a mile, I might have believed it, though I would have thought it was on the high side.</p>\n<p>I spend the vast majority of my day sitting in front of my computer, using vim. I don’t walk around nearly enough, and I really don’t think I walk 10 miles a day when most days I don’t even leave the damn house.</p>\n<p>I had so many hopes that it would be at least somewhat accurate. I wanted, and still plan to, move around more. I have the shittiest knees in the world (I’ve had multiple knee surgeries), so moving around is always hard. With the idea of having a step counter, I had hoped that it would form a little bit of motivation. With how inaccurate the Apple Watch is, I don’t know how well it will work.</p>\n<p>Though I will still try to use it, of course, it won’t be as useful as it could otherwise be.</p>\n<p>The other thing I really wanted was a reminder to stand up every so often. I usually get engrossed in my writing and work and forget to stand up as many times an hour as I should. So I thought that the Apple Watch would help with that. So far, I have been disappointed. It does count how many times you stand up, but only once an hour, and it will only remind you if you’re close to not meeting your daily goal. There might be something I’m missing here, but if not, it’s not as handy as I had hoped.</p>\n<h2>The Notifications</h2>\n<p>The one good area of the watch so far has been the notifications. For the most part the notifications I get on the watch are completely useless. But, because they come in on the watch, where you can do nothing with them for the most part, I dismiss them and I don’t think about them.</p>\n<p>That means that I’ve actually used my phone much less. So despite the distraction of the notifications coming in and buzzing my wrist, I do tend to stay away from my iPhone more, which means less time wasted on YouTube and whatnot, which often happened whenever I picked it up to check an email.</p>\n<h2>Conclusion</h2>\n<p>It’s only been a week. I think that I will continue to give it a try. I don’t think that everyone who touts this thing as a health or fitness gadget really knows what they’re talking about. I hope that no one really takes this data seriously, because so far, I can’t see where it is anywhere near accurate.</p>\n<p>That being said, I still kind of like it. It may be useless, but in typical Apple fashion, the hardware is excellent and I have found I enjoy having a clock with a timer on my wrist. I think I may try the pomodoro technique again, so this might help with that.</p>\n<p>If you'd like to receive these blog posts a week early, you can support me on Patreon Here</p>\n<p>I hope everyone has a nice week,</p>\n<p>Matt</p>\n",
      "date_published": "2022-06-06T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/0006/",
      "url": "https://thelinuxcast.org/posts/0006/",
      "title": "My Return to Android",
      "content_html": "<p>A few months ago, I talked about how I switched to iOS after having used Android for almost 3 years. As I said then, that switch was one that I usually do every 3 years or so, if only to see what the other main platform has come up with.</p>\n<p>For the last few months, I've been using an iPhone 11 Pro Max, and to be honest, I love the hardware but I can't stand iOS. It's odd because I used to love iOS. The apps for Apple's platform have always been superior (and I still feel that way for some apps), and their ability to deliver updates to so many of their devices immediately is both impressive and awesome for the user. I always like new things and being able to install the latest update right from Apple without having to wait for a carrier to do it just makes me happy.</p>\n<p>But iOS itself is horrible. The notifications are even worse than they were the last time I spent any time on the platform and I found myself so constrained with moving around that the experience wasn't enjoyable.</p>\n<p>So let me break this down a bit.</p>\n<h2>Notifications on iOS</h2>\n<p>The biggest issue is that I love actionable notifications. And while iOS has these, they are only actionable when they appear. Once they disappear into your notification shade, you can't do anything but open the app or dismiss them. Add on top of that that there is no way for you to know a notification came in after it has appeared on your screen unless you see it on your lock screen, and the notification system is useless.</p>\n<p>Android is better. You can interact with the notifications in many ways, even from the notification shade, and there's an icon at the top of the screen indicating what notifications you have. Way better. Not that Android doesn't have its issues when it comes to notifications. I don't care for how there is a popup when the notification comes in. At least it is smaller than it used to be. I still do miss the scrolling notifications in the notification bar that used to be on Android.</p>\n<p>I don't understand why Apple can't do notifications right. They are such an important part of a mobile operating system, you'd think that they could get it right after over a decade of trying. But no.</p>\n<p>It honestly drove me crazy. While I don't care if I miss a notification from a game or something, missing notifications from messaging clients are annoying AF. And then not being able to go into the notification shade and respond from there is just bad design, especially when we know it can be done.</p>\n<h2>My Icons</h2>\n<p>I knew going in that I wasn't going to be able to easily make my home screen the way I wanted it. That was fine. Mainly because I found myself recreating the iOS grid on Android so often I didn't think I'd miss the ability to put icons wherever I damn well please</p>\n<p>But I did.</p>\n<p>I should have realized with my love of ricing, that I'd miss the ability to customize my phone, but I didn't think it would be that bad.</p>\n<p>On top of that, there is the lack of customization elsewhere that felt constraining. Things like being able to add things to the share sheet were just annoying.</p>\n<p>I lived with it, but it was always a constant thing in the back of my mind.</p>\n<h2>Siri is the worst</h2>\n<p>I always knew that Siri was behind Google Assistant in every way that matters. I just didn't think it was so far behind. Being able to do something simple like repeat a track or lower the volume while I'm in the shower is something I got used to with Android. You can't do that with Siri, or at least you can't do it easily.</p>\n<p>And sometimes the responses from Siri when asking a simple question were just dumb. And the number of times she just dumps you into a Google search is ridiculous. If all I wanted to do was search Google, I'd do that. The point of these assistants is to avoid having to do that directly and to be a bit hands-free about the whole thing. Siri doesn't get that? I don't know what Apple is doing.</p>\n<p>Sometimes I wonder if Apple even uses its own products. They don't seem to because if they did, their products would be better. Notifications would get fixed, and Siri would get better. But they don't. Ever. It's not as if this is a new problem, this has been the case for almost a decade when it comes to Siri and even longer when it comes to the notification problem.</p>\n<h2>Conclusion</h2>\n<p>I don't do all this bitching without knowing that Android doesn't have its own problems. The phone I bought is a Samsung Galaxy S21+, and there are apps on there that cannot be deleted or disabled and are running all the time. This drives me insane. Knowing that there are apps on there that are running that I don't want to run is just so aggravating. And it is not as if I can do the custom ROM thing as Samsung is known to disable parts of the hardware if you do that. So I could install lineage or whatever, and I'd just end up with a half-working phone.</p>\n<p>I guess the bottom line is that both platforms are flawed. At the end of the day, however, the things about Android piss me off less than the lack of customizability and poor notifications do on iOS.</p>\n<p>I wish there was a Linux phone out there that could save me from this. And I'm sure that if I made the switch, I could use it. But there are apps and games that I like to use on my phone that just wouldn't be available on a Linux phone. Maybe I'd just use my Phone less or adapt to using the web versions of some of the apps that have that sort of thing available, I don't know. Maybe I should give it a try and see just how usable a Linux phone is.</p>\n<p>Hope everyone is having a great week. If you're reading this on the website, you can get these blog posts a week early (along with the occasional early video as well) by supporting me on <a href=\"https://www.patreon.com/thelinuxcast\">Patreon</a>..</p>\n<p>Matt</p>\n",
      "date_published": "2022-05-10T00:00:00Z"
    },{
      "id": "https://thelinuxcast.org/posts/0001/",
      "url": "https://thelinuxcast.org/posts/0001/",
      "title": "My Love Affair With Krusader",
      "content_html": "<p>I'm a nerd.</p>\n<p>Kind of obvious, of course, but there is no place where my nerd-dom shines more as when I start talking about file managers.</p>\n<p>It's ridiculous, really. I have spend dozens of hours over the last two years looking for the 'perfect' file manager. Thunar didn't have dual pane mode, so I switched to Nemo, which had that feature. Nemo didn't remember close state, so I switched to Dolphin. That was too bloated with dependencies, so I switched to Krusader.</p>\n<p>Honestly the only file manager I haven't spent a lot of time in during the last couple of years is Nautilus, which I can't stand. I think it smells too much like Gnome.</p>\n<p>Krusader is my favorite Linux app that I've ever used. That's a shocking thing to even think about, really. A File Manager? Truly?</p>\n<p><a href=\"https://thelinuxcast.org/img/krusader.png\"><img src=\"https://thelinuxcast.org/img/krusader.png\" alt=\"Krusader\" /></a></p>\n<p>Yes. I'm foolishly enamored with Krusader. It has everything I ever wanted in a File manager. Good tab management. Remembers close state (i.e. all my tabs open up when I restart the app). Is dual pane by default. Has a ton of awesome features like comparing two directories and merging them. And so much more.</p>\n<p>Now, obviously it has it's own problems. Dependencies are kind of a mess. Image preview isn't enabled by default and actually requires a dependency. It also grabs focus for whatever reason sometimes and won't let go unless you click on another app. That's odd. But not a deal breaker.</p>\n<p>I've developed a system now that I keep all of my video projects, work projects open in tabs between the two panes, and just rely on them staying there until I'm done. It's messy by anyone's standards, but I love it. It had made it actually easier for me to keep track of the things I'm working on. Definitely not the way you should do it, but it works for me.</p>\n<p>It has led to something else, though. I've found myself using tabs other places much more than I used to. I used to be a 4 or 5 tab guy in Firefox. Now I have dozens and have adopted Tab Groups as my next new favorite thing. So I have way more tabs open all the time. Also uses a ton of memory. Right now I'm over 10GB used, which is nuts.</p>\n<p>So, yeah. I love Krusader. I thought about making another video about it, but decided that no one really cares about this type of thing. Maybe I might do it anyway.</p>\n<p>Hope everyone's week is going well,</p>\n",
      "date_published": "2022-05-05T00:00:00Z"
    }
  ]
}
